{"posts":[{"title":"Why Nobody Fights","text":"1. About the songReleased on August 15 2014. Toward the end of June 2014, when work on the album Quasimodo’s Gift was in its final stages, Hua Chenyu wrote “Why Nobody Fights” which was inspired by a most unlikely source. In an interview, Hua stated that the inspiration for this song came after watching a soccer match during his travels in Europe. He wanted to dedicate the song to his audience to encourage them to be true to themselves. Hua Chenyu takes great pride in the fact that he wrote the only line of lyrics in this song. He has only one other lyricist credit in his four-album repertoire. With each repetition of that line (why nobody fights), the delivery is slightly different. As a result, recording it wasn’t easy and it took several days. Bernard Zheng, now Hua’s long-time producer, recruited the renowned American mixing engineer, music producer, and multi-instrumentalist, Ken Lewis for the downmixing. Zheng initially invited some friends to sing the chorus, which in a concert setting would be sung by the audience. However, after listening to the rough cut, Hua felt that it was too perfect and decided to go in a different direction. To create the mysterious “choir-inspired” feeling that he wanted, many people would need to participate. Hua then recommended inviting his fans to participate. One hundred fans gathered at a large orchestral recording studio to complete the accompaniment and achieve the dramatic choral effect he had hoped for. 2. VideosAudio linkSpotify MV Making Film 2018 Mars Concert Beijing with ENG Subtitles` 3. LyricsCompose &amp; lyrics: Hua ChenyuArrange: Bernard Zheng ​Why, why nobody fight?Why nobody fight?Why nobody fight?","link":"/01-01-wnf/"},{"title":"Let You Go","text":"1. About the songReleased on August 29 2014. As soon as Hua Chenyu arrived home one day, he sat down at the piano and began to compose. “Let You Go” was the result. Beginning with the first harmony, the melody was already established, and Hua Chenyu was able to record the music as he played and sang. In his own words, it was “a song written in a song’s time.” After listening to the demo, Hua’s producer Bernard Zheng agreed that the chords he used and the emphatic way he sang “let you go” in English suited the electronic rock style. The arrangement of the song has two distinct parts; the first part of the song has the feeling of restraint, which allows the listener to focus on the vocals and the simple piano accompaniment. In the second part of the song, the restraint fades and energy begins to build. The long introduction creates a feeling of suppression until the end of the interlude where, following the rhythm of the drums and the incorporation of other instruments and electronic sounds, the tones are built and layered to create a theatrical conflict. The singer’s words in Chinese and English, “let you go, 别靠近我 (stay away from me),” intensifies that contrast. During audio mixing, Ken Lewis minimized the rock elements of the song, strengthening instead the electronic components, and finally toning down the guitar. 2. VideosMars Concert 2023 FanCam Mars Concert 2017 Official Video Mars Concert 2016 Official Video 3. Lyrics TranslationComposer: Hua ChenyuLyricist: Xia YuanArranger: Bernard Zheng Let You Go Let You Go 还不是尽头 If this is not the end 就让我继续游走 Let me keep on walking 还没到最后 If it’s not the last 就让我继续忍受 Let me keep on enduring 若是狂风带不走 If the gale can’t take away 残留胸口的念头 The thoughts that linger in my chest 抱着它沉入时间的洪流 Embrace them and sink into the torrent of time 还有快乐就 If there is still happiness 埋进遗忘的沙漠 Bury it in the desert of forgetfulness 还有哀愁都 If there’s still sorrow 抛下绝望的山丘 Abandon the hills of despair 还有什么没卷走 If there’s still something not taken away 留下影子就足够 Leaving shadows is enough 在孤独里头 陪着我 To accompany me in solitude Let you go Let you go 别靠近我 Don’t get close to me 我不是 被动感受的躯壳 I’m not a passive body to feel 没什么 能够夺走 我自由 Nothing can take away my freedom Let you go Let you go 别阻挡我 Don’t stop me 我已经 走在永恒的路上 I’m already on the path to eternity 不退缩 I won’t back down Let you go Let you go 别靠近我 Don’t get close to me 我只为 寻找到真实而活 I live only to find the truth 没什么 能够操纵 我选择 Nothing can manipulate my choices Let you go Let you go 别阻挡我 Don’t block me 我只要 燃烧不在乎陨落 I just want to burn, no matter the fall Let you go Let you go 别让自我被拯救 Don’t let the self be saved","link":"/01-03-lyg/"},{"title":"Glimmer (微光)","text":"1. About the songReleased in 2014. The interlude music for the TV drama “何以笙箫黙” (Silent Separation).This song is included in the first album “Quasimodo’s Gift“. “Glimmer” just like its name, is a soft and gentle song performed with exceptional tenderness by Hua Chenyu. A piano accompaniment is all that’s needed as he sings this simple melody. The music is sometimes quiet, sometimes it swells. “Glimmer” is intricate and intense, but without the rock edge and technical high notes Hua is known for. This delicate arrangement highlights the beauty and power of Hua Chenyu’s voice and demonstrates his careful control. Still, Hua permits the subtle emotion of the song to shine, which allows the listener to feel that glimmer of light. On April 20, 2018, Hua Chenyu performed this iconic piece during the post-festival of the music competition program “[Singer 2018](/Singer 2018/)” He also had collaborations with the Chinese pianist Lang Lang in various performances. On September 25, 2022, during the online concert “火星乐章 (Mars Chapter)“ celebrating his 9th debut anniversary, Hua Chenyu arranged 11 songs in collaboration with a symphony orchestra and choir. 2. Videos“Mars Chapter” SymphonyENG Subtitles “Mars Concert 2019 Haikuo”ENG Subtitles “Singer 2018”ENG Subtitles “2015 Liaoning TV Spring Festival Gala” feat. Lang Lang 3. Lyrics TranslationLyrics: Zhou Jieying Zhou JieyingCompose: Qian Lei Qian LeiArrange: Bernard Zheng Bernard Zheng 微光 Glimmer 我在黑暗中 In the darkness 化作一颗火种 I became a tinder 想为你 For you 点亮整片的星空 I want to light up the entire starry sky 追随着微风 With the gentle breeze 住进了美梦 I stepped into this sweet dream 你笑着 Your smiling figure 躲在我心中 Hidden deep in my heart 不要烟火不要星光 No need for fireworks nor starlight 只要问问内心的想法 Just ask your heart 在我的世界 In this world of mine 可有个角落 Is there a corner 是你不曾懂的远方 As distant land, you’ve never known? 也许我是一道微光 Perhaps I am a faint glimmering light 却想要给你灿烂的光芒 Yet wishing to enshrine you in dazzling rays 宁愿让我受伤 I would rather get hurt 在黑暗的夜晚 In the darkness of night 静静地为你 Quietly For you 去孤独的照亮 Shine in solitude 就让我是一道微光 Just let me be a glimmer 能让你拥有灿烂的锋芒 That lets you shine brilliantly 在寂寞的时分 In times of loneliness 无论飞向何方 No matter where you fly 我也会绽放 I will still shine 给你无限微光 Giving you an endless glimmer","link":"/01-02-shimmer/"},{"title":"Ashes from Fireworks (烟火里的尘埃)","text":"1. About the songReleased on August 26, 2014. After listening to the demo for “Ashes From Fireworks”, Hua Chenyu felt that the delicate melody was quite suitable for his voice and decided to include it in this album. Xi Lou wrote the song in 2012 to comfort himself while going through a difficult time. The song was similar to the deeply personal song, “I Am What I Am“, covered by Hua Chenyu during the Super Boy 2013 competition. “Ashes From Fireworks” was not the typical kind of song that people were used to hearing. When Bernard Zheng received the demo for “Ashes From Fireworks”, he felt it was a fortuitous coincidence as he knew the composer, Xi Lou. Zheng felt that he and Hua Chenyu shared a common understanding of music, so in order to preserve the original feeling of the song, he asked Xi Lou to help with the arrangement. Xi not only helped complete the second arrangement of the song, but ultimately stayed throughout the entire recording process. This process included five mixing modifications and Xi also recorded the harmony. In keeping with the conceptual ideas of the album, the theme of “smoke” was used throughout the arrangement and lyrics. Albert Leung, a judge for the 2014 Spring Festival Gala, was deeply impressed by Hua’s singing in the competition. Leung was invited and immediately agreed to write lyrics for this album. In preparation for writing, he watched many videos and read many articles about Hua. Following the official recording, Leung changed the lyrics for “Ashes From Fireworks” an additional three times to ensure they represented the true feeling of Hua Chenyu’s inner world, and also to ensure they conformed to his high standards. In order to achieve the desired psychedelic effect of time and space, Hua Chenyu recorded the song so many times that he became hoarse. The end result was that the song appeared to be much easier to sing than it actually was. 2. VideosMVENG Subtitles “Mars Chapter” SymphonyENG Subtitles Shanghai Zebra Music Festival 2018ENG Subtitles 3. Lyrics TranslationLyrics: Albert Leung Albert LeungCompose: Xi Lou Xi LouArrange: Xi Lou、Bernard Zheng Xi Lou, Bernard Zheng 烟火里的尘埃 Ashes from Fireworks 看着飞舞的尘埃 掉下来 Watching the dancing ashes falling to the ground 没人发现它存在 No one notices their existence 多自由自在 So free and unbounded 可世界都爱热热闹闹 But the whole world loves company 容不下 我百无聊赖 There’s no place for me to be listless 不应该 一个人 发呆 I shouldn’t be alone lost in thoughts 只有我 守着安静的沙漠 I’m the only one who guards the silent desert 等待着花开 Waiting for flowers to bloom 只有我 看着别人的快乐 I’m the only one who looks at their happiness 竟然会感慨 And sigh unexpectedly 就让我 听着天大的道理 Just let me listen to these great philosophies 不愿意明白 Unwilling to understand 有什么 是应该 不应该 What should be and what shouldn’t be 我的心里住着一个 苍老的小孩 In my heart, there lives an elderly child 如果世界听不明白 对影子表白 If the world cannot understand Confess to your shadow 是不是只有我 还在问 Am I the only one still asking 为什么 明天更精彩 Why will tomorrow be better 烟火里 找不到 童真的残骸 In the fireworks no remains of innocence can be found 只有我 守着安静的沙漠 I’m the only one who guards the silent desert 等待着花开 Waiting for flowers to bloom 只有我 看着别人的快乐 I’m the only one who looks at their happiness 竟然会感慨 And sigh unexpectedly 就让我 听着天大的道理 Just let me listen to these great philosophies 不愿意明白 Unwilling to understand 只有我 就是我 好奇怪 There’s only me who is only me How strange 还在感慨 I am still sighing 风阵阵吹过来 Gusts of wind blowing past 为何不回来 Why does it not come back 风一去不回来 The wind leaves and never returns 悲不悲哀 Isn’t it sad 麻木得那么快 应不应该 We become numb so fast Shouldn’t it be 能不能慢下来 Can it slow down 笑得开怀 哭得坦率 Laugh to your heart’s content Cry like no one else judges 为何表情 要让这世界安排 Why should my expressions Be arranged by the world 我就是我 我只是我 I am just me, I am only me 只是一场烟火散落的尘埃 Just falling ashes from fireworks 风阵阵吹过来 Gusts of wind blowing past 风一去不回来 The wind leaves and never returns 能不能慢下来 Can it slow down","link":"/01-04-fireworks/"},{"title":"Bomb Squad (拆弹专家)","text":"Released on August 26, 2014. “Bomb Squad” was another composition by Danish indie rock band Dúné and arranged by Dúné and Bernard Zheng. Zhao Zhisheng, a young lyricist, wrote the rebellious and humorous lyrics. The style of the song is indie rock with imaginative, catchy lyrics. Vocals throughout the song are high-pitched and are accompanied by a chorus of children’s voices along with repeated rhythmic drumming and clapping sound effects. These stylings make the song novel, interesting, and easy for Martians to sing along with. VideosMars Concert 2019 FanCamENG Subtitles Mars Concert 2016 Official VideoENG Subtitles Lyrics TranslationComposer: DúnéLyricist: Zhao ZhishenArranger: Dúné, Bernard Zheng 拆弹专家 Bomb Squad Hell！！No！！ Hell！！No！！ 空气就快要爆炸 The air is about to explode Hell！！No！！ Hell！！No！！ 时间就快要爆炸 Time is about to explode Hell！！No！！ Hell！！No！！ 身体就快要爆炸 My body is about to explode Hell！！No！！ Hell！！No！！ 快给我拆弹专家 Hurry up and get me the Bomb Squad GUCCI PRADA GUCCI PRADA 穿着要足够浮夸 You have to dress extravagantly 才能够表现自己的身价 To flaunt your own worth 算了吧 Forget it 看着你声音沙哑的 Watching you with your hoarse voice 娱乐大家 但 Entertaining the crowd 心中的炸弹快要爆炸 But the bomb in your heart is about to explode Hell！！No！！ Hell！！No！！ 空气就快要爆炸 The air is about to explode Hell！！No！！ Hell！！No！！ 时间就快要爆炸 Time is about to explode Hell！！No！！ Hell！！No！！ 身体就快要爆炸 My body is about to explode Hell！！No！！ Hell！！No！！ 快给我拆弹专家 Hurry up and get me the Bomb Squad","link":"/01-05-bomb/"},{"title":"Traveling (环游)","text":"1. About the songReleased on September 19, 2014. “Traveling” is one of several songs chosen by Hua Chenyu which were composed by the Danish band, Dúné. He liked their songs so much that he actually chose four for his first album. The vocals, sound effects, and instrumentation come together to make “Traveling” sound ethereal, transparent, and psychedelic; as though traveling in outer space. The lyrics describe a journey through life where Hua Chenyu encourages listeners to follow that journey with courage and youthful vitality. The song conveys the positive energy of youth, a new generation of rock style in comparison to the previous heavy and rather angry expression of the former generation. The studio version incorporates a multitude of electronic sound effects, and although perhaps not as popular as “Ashes From Fireworks“ or “I Don’t Care“, “Traveling” is an extremely challenging song to sing with a wide range and many different transitions from one register to another. 2. VideosMars Concert 2021 FanCamENG Subtitles Mars Concert 2019 FanCamENG Subtitles Mars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Nagatomo Chie Mei；Liu YuanCompose: DúnéArrange: Dúné，Bernard Zheng 环游 Traveling 我在 拥挤路口 I stand at a crowded intersection 听人群 争吵不休 Listening to the crowd’s endless quarrels 吵着无谓借口 Arguing over pointless excuses 吵着向左向右 Arguing over going left or right 我环游 这颗星球 I travel around this planet 看时间摆弄着沙漏 Watching how time fiddles with hourglasses 我不原地停留 I don’t want to stand still 我大步行走 I stride forward 走出精彩 Striding towards brilliance 双脚飞 Fly on both feet 没有疲惫 Never tire 飞翔着 倔强的花蕾 Soaring a tenacious flower bud 阳光飞 Fly boldly 没有伤悲 Without sorrows 世界明媚 What a bright world 彼岸爱上寻找 The other shore falls in love with searching 而天空爱上了奔跑 Yet the sky falls in love with running 我们怎敢睡着 How dare we fall asleep 我们怎敢牢骚 How dare we complain 生命这 无休旅程 This life is an endless journey 然后的然后是追逐 Chasing is in the future of the future 看看谁会认输 Let’s see who will concede 看谁会停步 Let’s see who will halt their steps 我会 一路奉陪 I will stay all the way 勇敢飞 Fly bravely 拥吻雨水 Embrace and kiss the rain 逆风让翱翔 更珍贵 Soaring upwind makes the flight more cherished 灿烂飞 Fly gloriously 拥吻沉醉 Embrace and kiss this enchantment 坚强花蕾 An unwavering flower bud 飞翔的花朵 Soaring blossoms 天空的焰火 A blaze in the sky 没有太多言说 Few words are uttered 骄傲的沉默 This proud silence 行进若不退缩 If the march never backs off 梦不会陨落 Then dreams will not fall down 飞翔的自我 The self that flies 勇敢飞 Fly bravely 拥吻雨水 Embrace and kiss the rain 逆风让翱翔更珍贵 Soaring upwind makes the flight more cherished 灿烂飞 Fly gloriously 拥吻沉醉 Embrace and kiss the enchantment 坚强花蕾 An unwavering flower bud","link":"/01-06-travel/"},{"title":"We are all Lonely (我们都是孤独的)","text":"1. About the songReleased on September 19, 2014. A somber melody and uncomplicated lyrics bring a kind of dark mood to this song. It portrays a truth that resonates deep in the heart: we are all lonely. At some point in our lives we all feel alone, our dreams lost, invisible, and unappreciated. We feel the singer’s heartbreak as he exposes his pain. His voice weeps as he describes the falling rain and the lonely road home. The interlude transports us there with him as the sound of the wailing guitar and the singer’s dejected tone accompany us. As the song ends, we feel a final sigh in the gentle tones of the piano and guitar. 2. VideosMars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Dai YuedongCompose: The Blue VanArrange: The Blue Van；郑楠 我们都是孤独的 We are all Lonely 他 忘记了 He forgot the way home 回家的路 街上只剩他 一个人 The way home, on the streets, he was the only one left 游荡 Wandering 他 拥抱过 He once held in his arms 生命中 相遇后又错失的人 The person he met and then lost in life 悲伤 How sad 雨 在下 在下 一整夜 The rain is falling, falling, all night long 他 不作声 不作声 He keeps his silence 他的痛 有谁能懂 His silence, his pains, who can understand? 他的梦 无人过问 His dreams, no one cares 他多么想 多么想 安稳 How desperately he longs, longs for a simple life 他 厌倦了 He has grown weary 所以活在自己的世界里面 So he lives in his own world 天真 How naive 他 明白了 He understands 上帝为他关上窗另开一扇门 God has closed a window and opened another door for him 在等 Waiting 雨 在下 在下 一整夜 The rain is falling, falling, all night long 他 不作声 不作声 He keeps his silence 他的痛 有谁能懂 His silence, his pains, who can understand? 他的梦 无人过问 His dreams, no one cares 他多么想 多么想 安稳 How desperately he longs, longs for peace of mind 他多么想 多么想 安稳 How desperately he longs, longs for peace of mind 雨 在下 在下 一整夜 The rain is falling, falling, all night long 他 不作声 不作声 He keeps his silence 心里的痛 有谁能懂 Pains in the heart, who can understand? 谁的梦 无人过问 Whose dreams, no one cares 他多么想 多么想 安稳 How desperately he longs, longs for peace of mind 我们都是 都是孤独的人 We are all, we are all lonely","link":"/01-07-allalone/"},{"title":"Immortal (不朽)","text":"1. About the songReleased on September 17, 2014. “Immortal” is another song originally composed by indie rock band Dúné and chosen by Hua Chenyu. Given that song selection was made from over 20,000 demos, it’s clear that Hua truly loves the music of this band, as he chose several of their songs in this first album. The fast-paced musical style of “Immortal” is metal, rhythmic, and rocky. There are distinct stylistic differences between the more electronic verses and the rock-style chorus. Bernard Zheng’s arrangement emphasized the guitar segments with a very interesting interlude. The vocals are challenging for the singer, as they are high in the treble range with explosive segments. Hua Hua received praise from the sound engineers during the recording process as he was not only able to sing in that high range for many hours at a time, but also returned the next day rested and able to give his best. The young and wild attitude of the song arises from the combination of melody, instrumentation and Hua’s powerful singing. The wonderful lyrics composed by Guo De Ziyi are determined, proud and unyielding; echoed by the wild cries of a princely, passionate young man. 2. VideosMV Mars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Guo DeziyiCompose: DúnéArrange: Dúné，Bernard Zheng 不朽 Immortal 生活是种借口 Life is an excuse 胁迫人放弃一切拥有 Threatening us to give it all up 我活得捉襟见肘 I’m stretched thin 但是我get it get it But I get it get it 我是 不朽 I am Immortal 虽然 你眼里 的我 Although in your eyes 只不过 一头困兽 I am nothing but a trapped beast 我该 不朽 I should be Immortal 霸占 永恒才足够 Only by seizing eternity can I be satisfied 不屑做 卑微小丑 I’m above being a lowly clown 懦弱不是理由 Cowardice is not an excuse 让我 quit quit quit to fight To let me quit quit quit to fight 随着时间腐朽 As time decays 抱歉我get it get it Sorry, but I get it get it 我是 不朽 I am Immortal 占据 理智的 魔咒 A curse that takes over all rationality 如黑洞 吞噬所有 Like a black hole that devours all 我该 不朽 I should be Immortal 拒绝 被现实遗漏 I refuse to be forgotten by reality 不屑做 卑微小丑 I’m above being a lowly clown 我是 不朽 I am Immortal 就该 被铭记 永久 Should be engraved into memory forever 被侍奉 毫无保留 Served without reservations 我该 不朽 I should be Immortal 受众生 膜拜 永久 Forever worshipped by all beings 我拥有 完美自由 I have the perfect freedom 我是 不朽 I am Immortal 就该 被铭记 永久 Should be engraved into memory forever 被侍奉 毫无保留 Served without reservations 我该 不朽 I should be Immortal 受众生 膜拜 永久 Forever worshipped by the world 我拥有 完美自由 I have the perfect freedom 我本就是不朽 I’m Immortal to begin with 何必妥协迁就 Why should I compromise or yield 现在轮到你叩首 Now it’s your turn to kneel down 说你 get it get it Say you get it get it","link":"/01-08-immortal/"},{"title":"Quasimodo&#39;s Gift (卡西莫多的礼物)","text":"1. About the songReleased on September 12, 2014. Hua Chenyu’s inspiration for “Quasimodo’s Gift” came after seeing an abstract painting in a church in Italy during the European tour of the reality television show “Divas Hit the Road (花儿与少年)“. At that time, because of the program’s regulations, mobile phones had to be turned in to the producers; as a result, he had no device on which to record the melody. After returning to China, he explained that he was not able to remember the melody, but two months later while composing songs for his album, he suddenly recalled that painting and immediately recorded the music on the piano. When writing this song, the picture in Hua Chenyu’s mind was of a church at night, with a lonely sufferer kneeling in front of a single candle. “Quasimodo’s Gift” is in some ways classical in style, but is still infused with popular musical elements. Bernard Zheng produced the music so that the painful feelings evoked by the demo became more beautiful and sad. He also included the sounds one would experience on a dark and rainy night, such as thunder, lightening, and church bells. These environmental sounds immediately bring to mind a lonely singer in the dark. It took Hua Chenyu only about two hours to record this song. 2. VideosShort Movie MVENG Subtitles “Mars Chapter” SymphonyENG Subtitles 3. Lyrics TranslationLyricist: Bei ZiCompose: Hua ChenyuArrange: Bernard Zheng 卡西莫多的礼物 Quasimodo’s Gift 夜晚传来钟声 The sound of bells rang through the night 风熄灭了蜡烛 The wind blew out the candle 钟楼外 他的歌声 Outside the bell tower / His singing 回荡夜空 Echoes through the night 镜子里的怪物 The monster in the mirror 穿着同样衣服 Is dressed the same 在无助眼神之中 In helpless eyes 是无边的孤独 呜 Lies unending loneliness 沉痛的歌 This melancholic song 在诉说 Is crying out that 这不是谁的错 This is nobody’s fault 卡西莫多的礼物 Quasimodo’s Gift 享受孤独 Enjoying loneliness 阳光从不光顾 Sunshine never visits me 月光为我伴舞 Moonlight dances for me 巴黎夜晚的钟声 Ringing bells in the night of Paris 是我的音符 Are my musical notes 如果习惯痛苦 If I’m used to the pain 眼泪不会很苦 The tears won’t taste too bitter 若你伤悲 If you are sad 让我钟声 Let my ringing bells 给你安慰 Comfort you 沙哑的歌 含着泪 This rasping song 含着泪 Brimming with tears 也为你祝福 Still gives you its blessings 卡西莫多的礼物 Quasimodo’s Gift 享受孤独 Enjoying loneliness","link":"/01-09-quasimodo/"},{"title":"Bedside Story (枕边故事)","text":"1. About the songReleased on September 19, 2014. “Bedtime Story” is not what you would call a “big” song, with only a guitar for accompaniment; however, the lyrics are simple and touching. They relate the fairy tale story of a princess who falls in love with a frog, marries him against the family objections, and then they go away to live happily ever after. The novice songwriter, Ronald Tsui, spent a few years in the UK and was influenced by 90s pop, R&amp;B, and soul, but was focused on two things; simplicity and love. The writer of the lyrics in Chinese, Dai Yuedong, emailed them in the middle of the night to Hua, laughingly pointing out the frogs, the prince, and the fairy tale-like aspects of the subject matter. It was love at first sight for Hua Hua. 2. VideosMars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Dai YuedongCompose: Ronald TsuiArrange: Niu Zijian 枕边故事 Bedtime Story 就让我轻轻为你 Let me gently 讲一个枕边故事 Tell you a bedtime story 从前有个长发公主 Once upon a time there was a long-haired Princess 悄悄爱上一只青蛙 Who secretly fell in love with a Frog 青蛙每天都为她唱歌 Everyday the Frog would sing for her 国王皇后都反对他 Neither the King nor Queen approved of him 但是公主说他是我心上人 But the Princess said / He is my beloved 我不能就这样和他道别 I cannot bid him farewell just so 谁知道 Who knew 小青蛙变成王子 The Frog turned into a Prince 带着他的公主逃离皇宫 The Prince took his Princess away from the palace 私奔到一个 Eloping to a land 没人打扰的地方 Where they can live in peace 从此后两个人 And the two of them 幸福的在一起 Lived happily ever after 这是他和她的童话 This is his and their fairy tale 谁知道 Who knew 小青蛙变成王子 The Frog turned into a Prince 带着他的公主逃离皇宫 The Prince took his Princess away from the palace 私奔到一个 Eloping to a land 没人打扰的地方 Where they can live in peace 从此后两个人 And all of them 幸福的在一起 Lived happily ever after 这是他和她的童话 This is his and their fairy tale 明天我还会为你 Tomorrow too I will tell you 讲一个枕边故事 Another bedtime story 今晚月亮也想睡了 Tonight even the moon is sleepy 在你耳边说声晚安 Whispering in your ear Good night","link":"/01-10-pillow/"},{"title":"eSports - mobile game &quot;Game For Peace&quot; (Updated on Nov. in 2023)","text":"Information about eSports - mobile game “Game For Peace”. Celebrity Endorsement On November 2, 2020, Hua Chenyu served as one of the four celebrity endorsers for “Game For Peace”.During the next three years, other celebrity endorsements changed frequently, but Hua Chenyu was the only one who did not cancel his contract. ◎ Theme Song On April 26, 2021, the game’s second anniversary theme song “[Flying Conductor Flying Conductor (飞行指挥家)“ was officially released. On March 13, 2022, the “Game For Peace” Peace Elite League (PEL) annual theme song “Iconic moment (名场面)“ was released. On August 17, 2023, “Game For Peace” Peace Elite League (PEL)’s annual theme song “War God in Dire Straits (绝境战神)“ was released. ◎ Voice-Over On April 26, 2021, Hua released the theme song “Flying Conductor (飞行指挥家)“ and at the same time served as the narrator of the 2nd anniversary PV. In November of the same year, Hua served as narrator for the PV for the game’s “100 Great Elite Competition - Elite Declaration” event. A limited voice pack was released during the live broadcast on August 6, 2022. ◎ Exhibition Match Participated in an exhibition match at the game’s 2nd anniversary party in May 2021, teaming up with Peace Elite League (PEL)‘s top player 诚C. At the Airdrop Carnival on August 6, 2022, Hua teamed up with his best friend, Zuo Li, top player 诚C, and official commentator 阿梅 to experience a live game broadcast for the first time. On August 21, 2022, at the final match of PEL 2022 Summer Season, Hua sang the theme song and also participated in the exhibition match. On August 20, 2023, at the final match of PEL 2023 Summer Season, Hua sang three theme songs and participated in the exhibition match. Plan a Game Session at Mars Concert At the four Matinees of Mars Concert 2021, 100 people and 4 person competitions were held. Hua Chenyu and Zuo Li each led their own random teams against 92 other randomly selected fans.The winning team’s MVP was able to go on stage, listen to a song face-to-face with Hua, and receive an autographed prize.On December 4th, professional player 诚C also appeared as a guest and led another random team to participate in the match. At Mars Concert 2023‘s Chengdu performance, in addition to the on-site game competition, a live broadcast was also held online. Professional Player @花傲天1. Register as a Professional Player On May 30, 2023, Hua Chenyu was certified by the Peace Elite League (PEL) under the ID of @花傲天, and officially registered with the Hangzhou LGD Team as a youth player (Attacker).The name “傲天” describes an arrogant, conceited, and invincible character that appears in Chinese internet novels and Japanese Comic. 2. Holding the “傲夜天团 Cup” In July 2023, @花傲天 held the “傲夜天团 Cup” with a prize of 200,000 yuan. All participants are amateurs, and the top 30 amateurs can form teams with PEL professional players and compete in the finals. The “傲” in the name “傲夜天团” comes from the ID “@花傲天”, and the “夜” comes from the nickname of @花傲天’s fans, “熬夜(late night) 妹妹(younger sisters)”. “天团” comes from the title of Hua Chenyu’s fans [“ET天团”](/hcy-fan/#3-official performance). 3. PEL Debut Match On July 8, 2023, @花傲天 participated in the Peace Elite League (PEL) Summer Season / Regular Season / W6D3 as a youth player, and successfully completed his debut match. Due to the tension, his base heart rate in Round 1 was 130 and his maximum heart rate reached 173. -Get his first kill in Round 2. 4. The Annual 100-Person Big Challenge At noon on November 17, 2023, the annual 100-person big challenge called “集合100！(Gathering 100!)” officially began live streaming. Hua participated in two roles: the brand character Hua Chenyu and the professional player @花傲天. The event has invited not only PEL’s professional players, but also well-known anchors and gurus from various social media platforms, as well as many entertainment industry stars. Hua Chenyu’s best friend, Zuo Li, and fellow members of “Superboy 2013”, Ning Huanyu and Yu Xi, also attended the event.","link":"/esports-GFP/"},{"title":"Discography","text":"An index of all Hua Chenyu’s music works, including work details and purchase options. 1. Albumsin reverse order of release 5th “Hope Forget” Versions: Electronic edition / Chinese USB edition / Global CD editionFull original albumRelease dates: December 20, 2022 / May 10, 2023Online music sources: SpotifyCD online purchase: yesasia | taiwan FIVE music 希忘Hope Hope Forget Lyricist Composer 1 飞行模式MV Flight Mode Lyu Yiqiu Hua Chenyu 2 小镇里的花MV Flowers in a Small Town Lyu Yiqiu Hua Chenyu 3 小镇里的花Traditional Chinese Instruments Ver. Flowers in a Small Town Lyu Yiqiu Hua Chenyu 4 黑白艺术家 Black and White Artist Lyu Yiqiu Hua Chenyu Healing TrilogyStruggle Chapter 好想我回来啊 Searching for Myself Pei Yu Hua Chenyu Healing TrilogyHope Chapter 花落时相遇 We Meet When Flowers Fade Pei Yu Hua Chenyu Healing TrilogyFuture Chapter 走，一起去看日出吧 Let’s Go and Watch the Sunrise Pei Yu Hua Chenyu 8 向阳而生MV Growing Toward the Sun Lyu Yiqiu Hua Chenyu 9 点燃银河尽头的篝火 Light Up the Bonfire at the Galaxy’s End Lyu Yiqiu Hua Chenyu 10 当全世界忘了我 When the World Forgets Me nekoy Hua Chenyu 11 虚幻与现实 Illusion and Reality Lyu Yiqiu Hua Chenyu 2021火星演唱会全纪录Documentary 2021 Mars Concert Complete Record 4th “NEW WORLD” Versions: Versions: Electronic edition / Chinese USB edition / Global Version (2CD, Out of print)Full Original AlbumRelease Dates: May 3, 2020 / June 15, 2020 / June 15, 2020China Exclusive ‘Mars Necklace’ Limited Edition (USB, with Three Special Bonuses): Purchase on TaobaoOnline: Spotify | Amazon Music | KKBOXIFPI Certification: USB Edition = 6x Platinum Record, CD Edition = 2x Platinum Record + 1x Gold Record 新世界NEW WORLD NEW WORLD Lyricist Composer A1 斗牛MV Bullfight Pei Yu Hua Chenyu Mars Triology 好想爱这个世界啊 I’m Here AKAI Really Want toLove This World Pei Yu Hua Chenyu Mars Triology 疯人院 Madhouse Lyu Yiqiu Hua Chenyu Mars Triology 与火星的孩子对话MV Conversations with Martian Children Hua ChenyuET Hua Chenyu A5 七重人格 Seven Personalities Lyu Yiqiu Hua Chenyu A6 神树 God Tree Pei Yu Hua Chenyu A7 降临 Arrival Ding Yanxue Hua Chenyu A8 新世界 New World Ding Yanxue Hua Chenyu B1 寻MV Seek Shi He Hua Chenyu B2 无聊人 I’m Boring Pei Yu Hua Chenyu B3 齐天MV Qi Tian Ding YanxueJin HezaiFang Hao Hua Chenyu B4 智商二五零 IQ Two Hundred and Fifty Pei Yu Hua Chenyu B5 寒鸦少年MV Jackdaw Boy Ding Yanxue Hua Chenyu B6 蜡烛DEMO Candle Hua Chenyu 2018华晨宇火星演唱会Documentary 2018 Hua ChenyuMars Concert 3rd “H” Version: China Version (USB)Release Date: March 4, 2017Out of print H H Lyricist Composer 1 Here We Are Here We Are Mo AnqiZhaoYīteng Hua Chenyu 2 巨鹿 Giant Deer Dai Yuedong Hua Chenyu 3 To Be Free To Be Free Yue Yin Hua Chenyu 4 For Forever For Forever MIKHAÉL Hua Chenyu 5 我离孤单几公里 Miles Away From Loneliness Yi Jiayang Hua Chenyu 6 消失的昨天 Vanished Yesterday Yao Ruolong Wang Zi 7 造物者 The Creator Shi He Peter BostromAndreas Ohrn 8 我的滑板鞋2016 My Skateboard Shoes 2016 Joseeh PunmanlonHua Chenyu Hua ChenyuJoseeh Punmanlon 9 巨鹿 Voiceless Giant Deer Voiceless - Hua Chenyu 2nd “Aliens” Versions: China Version (USB) / China Version (CD) / Global Version (CD)Release Date: December 15, 2015Out of printOnline music sources: Spotify Contrary to the first album, which emphasized personal insignificance from a low perspective, in the second album, Hua Hua focused on self-worth and opted for a higher, more macro perspective. 异类 Aliens Lyricist Composer 1 我管你MV I Don’t Care Guo Deziyi Hua Chenyu 2 国王与乞丐MV King and Beggar Dai Yuedong Mike ChanFaizal Tahir 3 蜉蝣MV Mayfly Dai Yuedong Hua Chenyu 4 反义词 Antonym Xiao Han Wang Zi 5 异类MV Aliens Zhao Chenlong (NZBZ) Hua Chenyu 6 逃离乌托邦 Escape from Utopia Dai Yuedong Aurora AksnesMartin Odd SkalnesMagnus Skylstad 7 世界是个动物园 The World is a Zoo Dai Yuedong Hua Chenyu 8 变相怪杰 The Mask Dai Yuedong TakuyaLin ChengyouJimmy FungHua Chenyu 9 写给未来的孩子 To my Future Child Zhu Ziqing Hua Chenyu 10 地球之盐 Salt of the Earth Xiao JunfengDai Yuedong Hua Chenyu 11 忧伤的巨人 Giant in Sorrow Dai Yuedong Hua Chenyu 1st “Quasimodo’s Gift” Versions: China Version (CD) / Global Version (CD)Release Date: September 19, 2014Out of printOnline music sources: Spotify When preparing this album, Hua Chenyu’s original thought was to call it Size 40, since this is his own shoe size. The idea behind Size 40 was that a person really doesn’t need to take up too much space in the world. After all, you only have two feet, so you only need so much space to stand in. In true Hua Hua fashion, his sentiment is to just “go with the flow”; otherwise, there’s no need to make a big fuss. As long as you’re standing, your existence is valuable. Later, after receiving the lyrics for the song “Quasimodo’s Gift”, he changed his mind. He really liked the lyrics to the song, as they were true to the melody. This was the feeling he wanted for the album, so he decided to use the name of the song as the name of the album. He hoped everyone would learn to accept the negative things in life, even the ugliness we may encounter. Since everything has two sides, beauty may be hidden within those negative things. It’s just a matter of learning to see both the good and the bad.Among the ten songs on the album, three were Hua’s original compositions; “Why Nobody Fights”, “Let You Go”, and “Quasimodo’s Gift”. In addition to composing for this album, Hua also participated in the entire production of the album as well as selected the other seven songs from nearly 20,000 demos. All the songs chosen for this album are connected by the themes of thunder, rain, smoke, dew, light and dreams. The album was produced by Bernard Zheng and production lasted for nine months. Zheng arranged nine of the songs in rock and roll style and he also did the piano and guitar arrangements for the album. The copywriting for Hua Chenyu’s first album was prepared by Wu Mengzhi, now a director for Hunan TV. 卡西莫多的礼物 Quasimodo’s Gift Lyricist Composer 1 Why Nobody FightsMV Why Nobody Fights Hua Chenyu Hua Chenyu 2 微光 Glimmer Zhou Jieying Qian Lei 3 Let You Go Let You Go Xia Yuan Hua Chenyu 4 烟火里的尘埃MV Ashes from Fireworks Albert Leung Xi Lou 5 拆弹专家 Bomb Squad Zhao Zhisheng Dúné 6 环游 Traveling Nagatomo Chie MeiLiu Yuan Dúné 7 我们都是孤独的 We are all Lonely Dai Yuedong The Blue Van 8 不朽MV Immortal Guo Deziyi Dúné 9 卡西莫多的礼物Short Movie Quasimodo’s Gift Bei Zi Hua Chenyu 10 枕边故事 Bedside Story Dai Yuedong Ronald Tsui 2. Non-Album Singlesin reverse order of release English Title Chinese Title Release Date Extraordinary Ordinary Life 普通到不普通的人生 2023.12.2 Sea of Wind 风之海 2023.9.28 War God in Dire Straits 绝境战神 2023.8.17 No Fear of Heat 肆无惧燥 2022.6.15 Iconic moment 名场面 2022.3.14 Flying Conductor 飞行指挥家 2021.4.26 Quench Every Thirst 无渴不爽 2021.3.22 Endless Thirst 渴不停 2020.4.2 You Have To BelieveThis Is Not the Last Day 你要相信这不是最后一天 2020.2.21 Folding 声希 2019.1.13 Fresh Trip 夏之旅 2018.6.6 Hi Summer 嗨夏 2017.6.15 Follow Me 随我 2017.4.11 Wounded in Fights 挂彩 2017.1.9 Through My Heart 穿心 2016.11.7 Mars Intelligence Agency 火星情报局 2016.4.7 Rampage 横冲直撞 2016.3.7 Cancer 癌 The Return of the Master 高手归来 This is Young 就这Young Spring 春 2014.11.27 Hi! Freedom Hi！自由 Goodbye, Youth 青春再見 I and Me 我和我 Lyricless Song 无字歌 2013.6.29 3. Re-arranged Cover Songsin reverse order of release English Title Chinese Title Release Date Jump! The World 离开地球表面 2023.6.3 Ceased 静止 2023.5.20 Reset 归零 2023.5.20 Holding Hands 牵手 2023.5.13 Enjoy 安九 2023.5.6 Us, Later On 后来的我们 2023.4.30 Lucky as You 美好的事可不可以发生在我身上 2023.4.20 Bright Days 闪亮的日子 2023.4.13 The Green Ali Mountain 高山青 2023.4.6 Contentment 知足 2023.3.30 Dancing Siren 舞娘 2023.3.23 Must Be Happy 一定要幸福 2023.3.16 West Gate Youth 西门少年 2020.4.24 Contra in the Wild 荒野魂斗罗 2020.2.28 Ace VS Ace 王牌对王牌 2019.5.8 Tattered Shoes,Frayed Hat 鞋儿破 帽儿破 2019.3.1 Shouts 呐喊 2018.4.13 Light Years Away 光年之外 2018.4.13 The Ordinary Path 平凡之路 2018.3.30 Fake Monk 假行僧 2018.3.23 Wayfarer 山海 2018.3.16 Flammable and Explosive 易燃易爆炸 2018.3.9 Nunchucks 双截棍 2018.2.16 Child 孩子 2018.2.9 Insignificance 渺小 2018.1.13 Idiot 白痴 2018.1.6 Drunk As Lonely Hero 一人饮酒醉 2017.12.16 Dad, I’m Home 爸，我回来了 2017.12.9 Code Name Contra 代号魂斗罗 2017.11.25 Maiden Of Alisan 阿里山的姑娘 2017.10.15 You Better Not Think About Me 你就不要想起我 2017.9.2 Mr. Soso 差不多先生 2017.9.2 Perhaps Love 如果爱 2017.1.1 If You were Li Bei 如果你是李白 2016.12.25 Nanping Evening Bell 南屏晚钟 2016.12.18 Flammable and Explosive 易燃易爆炸 2016.12.11 Great Sage Equal To Heaven 齐天大圣 2016.11.27 Mice Loves Rice 老鼠爱大米 2016.11.6 My Skateboard Shoes 2016 我的滑板鞋2016 2016.10.30 The Kill The Kill 2013.7.12 4. Cover Songsin reverse order of release English Title Chinese Title Release Date Once You Were a Youth 你曾是少年 2022.7.1 Why are the flowers so red? 花儿为什么这样红 2022.6.10 Us 我们 2020.3.6 I am What I am 我 2018.4.6 Do It While You Are Still Young 趁你还年轻 Somebody That I Used to Know 2013.8.2 Chasing Dreams With a Childlike Heart 追梦赤子心 5. Composing for Othersin reverse order of release Artist English Title Chinese Title Release Date Karen Mok Half a Lifelong Romance 半生缘 2018.5.31","link":"/allmusicdata/"},{"title":"&quot;火星演唱会 MARS CONCERT&quot; list","text":"1. OriginWhen first debuted, Hua Chenyu was often referred to as the “boy from Mars (火星弟弟)” by the media, due to his slightly strange personality.Hua simply made “MARS” his image symbol, and promised his fans that “someday we will return to Mars together.” To fulfill this promise, Hua named his personal concert “MARS CONCERT (火星演唱会).” By the way, His fans also received the nickname “ET (Martian，火星人)“. 2. A Regular Part of MARS CONCERT Greet fans with “Welcome home (欢迎回家)” as the first greeting. When performing the song “The World is a Zoo (世界是个动物园)“, Hua always sings “oiaioiaioiaiaio” with a random melody and makes his fans repeat it. The melody gradually becomes more complex, and it always ends on a high note that fans can’t sing, thus becoming a reason for Hua to laugh at his fans. Before the concert ends, be sure to thank each staff and partner, such as band members, company, security team, fire brigade, etc. Every time Hua pronounces a name, ETs shout “Thank you”. From 2014 to 2017, always sing Leslie Cheung’s famous song I Am What I Am (我) as the last encore. Since this is a very special song for Hua and he only has the strength to sing it once a year, he wanted to use that only opportunity for MARS CONCERT. In 2018, after singing I Am What I Am (我), Hua went on to sing an unreleased new song “New World (新世界)” and declared to fans, “From now on, I will take you to a new world.” Through this action, Hua embarked on a new journey in his life. Starting in 2021, MARS CONCERT has been upgraded to an outdoor rock festival. Hua put his rock songs in the more exciting Evening Show, and put his early songs and some pop songs in the more relaxed Matinee. Also, rearranging songs into unplugged version for Matinee and singing along with guest Zuo Li has become a regular occurrence. We don’t know since when, fans started asking Hua for kisses during impromptu interactions, and Hua always satisfied fans with a “kiss song” after a “brewing”. 3. MARS CONCERT Schedule Year Number of performances Time Location 2014 2 Sept 6th-7th Beijing Mastercard Center 2015 3 July 31st - Aug 2nd Shanghai Gymnasium 2016 1 July 2nd Beijing LeSports Center 1 8月21日 Shanghai Mercedes Benz Arena 1 9月16日 Shenzhen Bay Sports Center 2017 2 Oct 13th-14th Beijing LeSports Center 2018 2 Sept 8th-9th Beijing National Stadium (Bird’s Nest) 2019 3 Nov 15th-17th Haikou Wuyuan River Stadium 2021 6 Nov 26th-8thDec 3rd-5th Haikou Changying Wonderland First half of 2023 3 April 7th-9th Hangzhou Baima Lake Park 3 April 30th - May 2nd Chengdu Open Air Music Park 2 May 27th-28th Wuhan Garden Expo Park 3 June 22th-24th Changsha Malanshan Yazui Park Second half of 2023 2 Sept 9th-10th Beijing National Stadium (Bird’s Nest) 3 Sept 27th-29th Shanghai Hongkou Football Stadium 1 Oct 21st Nanjing Olympic Sports Center 2 Dec 2nd-3rd Guangzhou University City Sports Centre","link":"/marsconcert/"},{"title":"2023 Event information (Updated on Nov. 12 in 2023)","text":"Event information other than personal concerts. Including live events such as music festivals and gala performances on TV. Click here for event information from past years: ③ Live: - ₂ Events NovemberTmall Double 11 gala11月10日Venue: Changsha - Malanshan Video Cultural and Creative Industry Park The Double 11, initiated by Tmall in 2009, has been around for 14 years. TMall’s Double 11 is not just a shopping festival but also a promotional extravaganza in the e-commerce industry, having evolved into a holiday for the entire sector.Since 2015, Tmall has collaborated with “Hunan TV” to organize a “Double 11” gala. Subsequently, the joint venture with TV stations to host a shopping frenzy gala has become a tradition.Hua Chenyu will present two songs: “Flight Mode (飞行模式)“ and “Light Up the Bonfire at the Galaxy’s End (点燃银河尽头的篝火)“ for everyone. “Flight Mode (飞行模式)“ Official Video “Light Up the Bonfire at the Galaxy’s End (点燃银河尽头的篝火)“ Official Video Backstage (live stream) August“Game For Peace” Peace Elite league (PEL) FinalsAugust 20 On August 20th, at the finals of the smartphone game “Game For Peace” Peace Elite League (PEL) 2023 Summer Season, Hua Chenyu sang three theme songs and also participated in the exhibition match. “Iconic moment“ “Flying Conductor (飞行指挥家)“ “War God in Dire Straits (绝境战神)“ Official Video June“The Moon Rises in the Bay Area” 2023 Greater Bay Area Movie Music Night PartyJune 29 On June 29, “The Moon Rises in the Bay Area” 2023 Greater Bay Area Movie Music Night Party (2023 Greater Bay Area Movie Music Night Party) was broadcast live on CCTV and multiple online video platforms.Jackie Chan, Andy Lau, Zhang Ziyi and more than 100 movie makers, musicians, culture, sports and technology representatives from both sides of the Taiwan Strait, Hong Kong and Macau will gather in Hong Kong to commemorate the 26th anniversary of Hong Kong’s return to the motherland.Hua Chenyu was honored to be the first singer to appear on stage after the opening, and she sang Beyond’s classic song “Earth” with the young Hong Kong band Supper Moment. “The Earth (大地)” With: Supper Moment Hua Chenyu (FanCam) Appeared as a special guest at Mayday’s live concert6月3日Venue: Beijing - National Stadium (Bird’s Nest) Hua Chenyu appeared as a special guest on the final day of Taiwan superband Mayday’s “Fly To 2023 (好好好想見到你)” Tour Beijing Station. It happened to be Mayday’s 20th live concert at Bird’s Nest, and Hua Chenyu also announced on the spot that he plans to hold a live concert at Bird’s Nest in the second half of this year.Both first collaborated on Mayday’s famous song “The Yet Unbroken Part of My Heart (我心中尚未崩坏的地方)”, and then Hua Chenyu performed his own hit song “I’m Here AKA I Really Want to Love This World (好想爱这个世界啊).On the day of the performance, Hua Chenyu had a stye in his right eye, which he hid with sunglasses. When he was teased that everyone wanted to see it, he immediately tried to take off his sunglasses and was hurriedly surrounded by surprised Mayday members and blocked from the camera. “The Yet Unbroken Part of My Heart (我心中尚未崩坏的地方)” “I’m Here AKA I Really Want to Love This World (好想爱这个世界啊)“ JanuaryStriving for a New Journey - China 2023 Online Audiovisual Annual CeremonyJanuary 24Online video platforms in China On January 24th, “Striving for a New Journey - China 2023 Online Audiovisual Annual Ceremony”, directed by China’s State Broadcasting Administration, was broadcast on more than 20 online video platforms. The cast and crew of over 800 performed nearly 50 masterpieces that have become internet favorites over the past year. “Let’s Go and Watch the Sunrise (走，一起去看日出吧)“ Official Video Vlog: Backstage “A worldwide celebration: Chinese New Year” GalaJanuary 22 At the “A worldwide celebration: Chinese New Year” Gala (2023全球华侨华人春节大联欢), Hua Chenyu sang his new song “Growing Toward the Sun (向阳而生)“ for the first time. “Growing Toward the Sun (向阳而生)“ Official Video Vlog: Backstage 2022 Weibo Music FestivalJanuary 18Venue: Beijing At the 2022 Weibo Music Festival hosted by Sina Entertainment, Weibo Music, Sina Music and Sina Productions, Hua Chenyu was awarded “Male Singer of the Year”.Hua Chenyu performed his new song “Flowers in a Small Town (小镇里的花)Traditional Chinese Instruments Ver“. “Flowers in a Small Town (小镇里的花)“ Hunan TV Countdown PartyJanuary 1Venue: Changsha - Malanshan Video Cultural and Creative Industry Park Hua Chenyu performed two songs from his 5th album “Hope Forget (希忘Hope)”, including the first released “Light Up the Bonfire at the Galaxy’s End (点燃银河尽头的篝火)](/05-09-milkyway/)”. “We Meet When Flowers Fade (花落时相遇)“ “Light Up the Bonfire at the Galaxy’s End (点燃银河尽头的篝火)“ Official Video","link":"/liveevent2023/"},{"title":"Sea of Wind (风之海)","text":"1. About the songFirst released in “Mars Concert 2023“ Shanghai concert, on September 28, 2023. It was officially released at 24:00 on the same day.This is Hua Chenyu’s first attempt at writing a refreshing song, and it is said to be the overall tone for his next album. 2. VideosOfficial VideoMars Concert 2023 - Shanghai Day2 3. Lyrics TranslationLyricist: nekoyCompose: Hua ChenyuArrange: Bernard Zheng、Hua Chenyu 风之海 Sea of Wind 摘一片云朵 Catch a wisp of cloud 踏在脚下看日落 and ascend it to watch the sunset 你在云的那头 Beyond the clouds’ edge, 掀起 一阵阵幻想 推着我走 you evoke waves of dreamsthat propel me forward. 想让你为我停留 Might you pause for me? 我迟钝伸出双手 With tentative hands, I reach out, 捕捉你的身影 Trying to catch traces of you, 瞬间 却弄丢你来时的线索 Yet swiftly, I lost the clues of your arrival. 唤醒我 Awaken me 指引我 Guide me 告诉我 Tell me 在哪里等待你会来认领我 Where can I wait for you to sweep me away? 你记得我最纯净的轮廓 You remember my purest silhouette, 握住小小风车和放肆的梦 Holding a small windmill and untamed dreams. 你小心保管我不思议的念头 You carefully guard my unconscious musing, 秘密从不会对谁泄露 Never reveal the secret to anyone. 平凡中寻得我拥抱你的温柔 Amidst the ordinary,I found the gentleness to embrace you, 而你却 有保留 地遇见我 Yet you approached me with a guarded heart, 不屑被谁所有 Loathing to be tethered by anyone, 你该有多自由 how boundless is your freedom. 我慌张奔走 I roam around in angst, 多像你来去无踪 So much like you,arriving and departing without a trace. 世界如此宽广 The world is so vast, 我们 终究要登上哪座山峰 To which pinnacle are we destined to ascend? 晴雨日升和月落 Through rain and glow, dawn and dusk, 你经过必有回声 Your passage will leave echoes. 起风时候 When the winds blow, 记得 再次 呼喊我奔跑吧跟随风 Remember to call upon me once moreto chase their gusts. 唤醒我 Awaken me 指引我 Guide me 告诉我 Tell me 在哪里走散你都会找到我 Wherever I get lost, you will find me. 你记得我最纯净的轮廓 You remember my purest silhouette, 握住小小风车和放肆的梦 Holding a small windmill and untamed dreams. 你小心保管我不思议的念头 You carefully guard my unconscious musing, 秘密从不会对谁泄露 Never reveal the secret to anyone. 平凡中寻得我拥抱你的温柔 Amidst the ordinary,I found the gentleness to embrace you, 躲在你 怀抱 Cradled in your embrace, 只顾向前走 I march onward without hesitation, 却探不到尽头 Yet with no end apparent; 你该有多 辽阔 such is your boundless infinity. 风吹醒 沉睡那首歌 Wind awakened the slumbering song, 追寻歌声 Chasing after the melody, 便找到风的海 we found the sea of wind, 小小孩是否能听见 它在笑呀 Can you hear the wind’s laughter,my little child? 欢唱吧 Sing joyfully, 呼唤他 Call out to him, 回来啊 Come back! 你经过我每个灿烂时刻 In every splendid moment you drift past, 我才真正学会如你般自由 I come to truly grasphow to embrace freedom as you do. 而你也曾温柔躲进她的眼眸 Once you also tenderly nestled within her gaze, 孤独被染上童话底色 And imbued solitude in fairytale hues. 任世界多宽广 Despite the world’s vast expanse, 停泊在这港口 anchor here in this harbor, 握住一瞬间 称它为永久 Seize the moment, and call it eternity. 再黯淡的星河 都趁着风闪烁 Even the faintest stars will twinkle with the wind.","link":"/kazenoumi/"},{"title":"Extraordinary Ordinary Life (普通到不普通的人生)","text":"1. About the songFirst released in “Mars Concert 2023“ Guangzhou concert, on December 2, 2023. It was officially released at 24:00 on the same day.This song inherited the refreshing style of his new song “Sea of Wind (风之海)“ released at the “Mars Concert 2023 Shanghai concert”. 2. VideosMars Concert 2023Guangzhou Day2 - FanCam 3. Lyrics TranslationLyricist: Lyu YiqiuCompose: Hua ChenyuArrange: Bernard Zheng 普通到不普通的人生 Extraordinary Ordinary Life 如果每一个人 注定要衰老 If we’re all bound to age 还不如留给花园 多一些色彩 It’s better to leave an extra burst of colorin the garden 告诉聪明的人 笨一些思考 Tell smart people to think less shrewdly 给人生留一束鲜花 And save a bouquet of fresh flowers for life 复杂世界总创造 不高兴和没头脑 The complex world always producesunhappy and reckless people 我却只想造一只猫 But I just want to create a cat 靠漫步将生趣填饱 Fulfilling my interests through free-roaming 心也有一片富饶 In my heart, there is also a realm of abundance 快乐就会笑 Just laugh in moments of happiness, 不再计较 两脚兽烦恼 no longer care about the troubles of those bipedal beasts 一次也好 Even if just for once 任青春消耗 Live your youth to its fullest 脚下花草 有日光就好 It’s all right as long asthe flowers and grass underneath bask in sunlight. 我想知道 蝴蝶柔软的一生 I want to to know How high a butterfly 到底能飞多高 can soar in its gentle life 如果每一个人 注定要衰老 If we’re all bound to age 还不如留给花园 多一些色彩 It’s better to leave an extra burst of colorin the garden 告诉聪明的人 笨一些思考 Tell smart people to think less shrewdly 再葆有这份热烈 And preserve this passion 多几个世代 for a few more generations. 普通到不普通的人 Extraordinary ordinary people, 哭着笑着的人 those who cry and laugh 给自己一个拥抱 Give yourself a hug 天生不会飞的鸟 If birds are born without wings 若努力积攒羽毛 yet strive to gather feathers 是否就能爱上风暴 Will they fall in love with the storm? 当天空伸手就碰到 When the sky is within reach 没有人低头祈祷 no one bows their head to pray 那你会知道 Then you’ll realize that 飞翔没有行走更重要 flying is less important than walking. 世界很吵 你别太苦恼 The world is noisy, don’t you worry too much 那片花草 Those flowers and grass, 晒月光也好 even bathed in moonlight, are fine. 我想知道 蝴蝶柔软的一生 I want to know how much beauty 到底曾看过多美的梦 could a dreaming butterfly witness in its gentle life 如果每一个人 注定要衰老 If we’re all bound to age 还不如留给花园 多一些色彩 It’s better to leave an extra burst of colorin the garden 告诉聪明的人 笨一些思考 Tell smart people to think less shrewdly 再葆有这份热烈 And preserve this passion 多几个世代 for a few more generations. 普通到不普通的人 Extraordinary ordinary people, 哭着笑着的人 those who cry and laugh 给自己一个拥抱 Give yourself a hug 儿时的天空多直白 The sky of childhood was so simple, 那么开阔 那么纯净 so vast and so pure 蹒跚追的美好憧憬 Awkwardly chasing those beautiful aspirations 一眨眼就远行 In the blink of an eye, they have gone far away 绕过云彩 Beyond the clouds, 多少我还活在天之外 how much of me still dwells outside this sky? 会不会有不同的精彩 Could there be other marvels to behold? 跟随蝴蝶的飞行 Trailing the butterfly’s flight 我也能抓住流星 I can also catch a shooting star. 灼伤了眼睛 也会目视着光明 Even if my eyes are scorched,I will still seek the light. 某一个瞬息 我们吹过同阵风 At a certain moment, we all felt the same breeze 如果每一个人 注定要衰老 If we are bound to age 还不如留给花园 多一些色彩 It’s better to leave an extra burst of colorin the garden 告诉聪明的人 笨一些思考 Tell smart people to think less shrewdly 再葆有这份热烈 And preserve this passion 多几个世代 for a few more generations. 普通到不普通的人 Extraordinary ordinary people 哭着笑着的人 Those who cry and laugh 眼泪别流出眼角 Don’t let tears trickle downfrom the corners of your eyes","link":"/ordinary/"},{"title":"MARS CONCERT 2023 (Second half)","text":"Time City Location Sept 9th-10th Beijing National Stadium (Bird’s Nest) Sept 27th-29th Shanghai Hongkou Football Stadium Oct 21st Nanjing Nanjing Olympic Sports Center Dec 2nd-3rd Guangzhou Guangzhou University City Sports Centre 1. Achievements After 5 years, Hua Chenyu once again held his personal concert for 2 consecutive days at the National Stadium (Bird’s Nest), the largest venue in China! The theme of this concert is a perfect report in which he looks back on the 10 years since his debut. This is Bird’s Nest’s first four-sided stage after the Olympic opening ceremony. The design and construction were also handled by the production team of the 2008 Beijing Olympic and 2022 Beijing Winter Olympic Opening and Closing Ceremonies, who are also Hua Chenyu’s fans. Set a record for a personal concert in China by attracting 100,000 people to a single performance. » Stage Design Photo Gallery « 2. Anecdote International Master Philharmonic Orchestra (国际首席爱乐乐团), which was in charge of the string production for Hua Chenyu’s 5th album, was invited. During the orchestra’s solo time, a rock version of Vivaldi’s “Winter” was played. In the form of a medley, Hua Chenyu sang all the classic cover songs since his debut at once. In the Intermission Video after the performance of “Flight Mode (飞行模式)“, the letters lit up in order on the keyboard were:tenyears huahua love marshuahua love marslove mars Took the initiative to give concert invitations (VIP tickets) to fans who were admitted to college this year, which everyone called the “Mars Scholarship.” Due to venue regulations, spraying of long ribbon paper is not allowed except for day2 in Beijing (Bird’s Nest). Therefore, Hua Chenyu directly posted on SNS the copy originally intended to be printed on the long ribbon paper. Translation Original Bird's Nest Day1 (Martians scattered around the earth!)Ten Years / Bird’s Nest / Welcome Home! （散落地球的火星人啊！）十年 鸟巢 欢迎回家！ Day2 Our story will be told till when we are old! 我们的故事会一直讲到老！ Shanghai Day1 2013.9.27-2023.9.27十周年 2013.9.27-2023.9.27 10th anniversary Day2 Chasing after the melodywe found the sea of wind 追寻歌声，便找到风的海 Day3 Mid-Autumn Festival, welcome home 中秋节，欢迎回家 Nanjing Hua Chenyu, let’s go and watch the sunrise together!”“Okay” “华晨宇，我们一起去看日出吧！”“好啊” Guangzhou Day1 A successful ending to this year’s live tour. 为今年的巡演画一个圆满的句号。 Day2 See you in Guangzhou! 我们 广州见！ perper (Hua Chenyu’s pet cat) was once photographed wearing a concert staff badge, and the position printed on the badge was to set off long ribbon paper. However, due to the venue regulations, long ribbon paper was not released, and Hua Chenyu blamed it on “perper being absent from work.” Beijing (Bird’s Nest) Concert » Beijing Concert Photo Gallery « Shanghai Concert The concert held one day earlier than scheduled to avoid the large number of tourists due to China’s National Day holiday. To celebrate his debut anniversary on September 27th, Hua Chenyu held an additional concert on Thursday. Therefore, it was held for 3 consecutive days from September 27th to 29th. New song “Sea of Wind (风之海)“ released for the first time. This is Hua Chenyu’s first attempt at writing a refreshing song, and it is said to be the overall tone for his next album. A four-day festival was held at a park near the venue, and fans bought goods and exchanged small gifts with each other at the park during the day, and then entered the venue directly at night. September 29th was the Mid-Autumn Festival, a traditional Chinese holiday. Just like during the Dragon Boat Festival, Hua Chenyu prepared mooncake gift sets limited to the Mid-Autumn Festival and sold them exclusively at festival stalls. At the Beijing concert, there was a bad guy trying to shoot him in the eye with a laser pointer. So, before the show started, audiences in Shanghai spotted several suspects and took them to police. But during the performance, a laser beam that hit his face was still captured on camera. » Shanghai Concert Photo Gallery « Nanjing Concert 10 years ago, a promise that “ choosing me was not a mistake “ was made on the “Superboy 2013“ live tour’s Nanjing concert. This time, Hua Chenyu returned to Nanjing and fulfilled that promise. Each fan brought a small windmill to the venue, and when Hua Chenyu sang “holding a small windmill” in his new song “Sea of Wind (风之海)“, everyone raised their windmill at the same time to give him a surprise. A fair was held on the huge lawn outside the stadium, giving fans the exact same amusement park experience as the outdoor venue in the first halfof the year! » Nanjing Concert Photo Gallery « Guangzhou Concert Hua Chenyu and ET prepared surprises for each other. At the climax of “Growing Toward the Sun (向阳而生)“, fans collectively raised sunflowers selfmade with twist sticks to form a sea of flowers. On Day 1, Hua Chenyu’s hair color was still light blue, which he named “Sea of Wind Blue”, but when he saw the sea of flowers, he was so excited that he couldn’t sleep that night, so he got up in the middle of the night and dyed his hair fuchsia. Before the encore of the final concert, a video clip was aired documenting how the idea for an all-night sunrise concert was conceived and developed. It has been officially announced that the sunrise concert will be held next spring on China’s northern coast during the flowering season. New song “Extraordinary Ordinary Life (普通到不普通的人生)“ released for the first time in “Mars Concert 2023 Guangzhou concert”, on December 2, 2023. It was officially released at 24:00 on the same day. This song inherited the refreshing style of his new song released at the “Mars Concert 2023 Shanghai concert”. Because the stadium is located in a university town and has a relatively low ceiling, large monitors set up on four sides of the top of the stage can be seen in many surrounding open spaces and dormitories. As a result, an unexpectedly large number of fans and passersby gathered in this “free area”. Hua Chenyu found out about this from SNS during a costume change, and in the next talk, he mentioned the fans outside and asked them to join in the chorus. » Guangzhou Concert Photo Gallery « 3. VideosOfficial Video“Sea of Wind (风之海)” Shanghai Concert - September 28, 2023 FanCam“Extraordinary Ordinary Life (普通到不普通的人生)” Guangzhou Concert - December 2, 2023 4. SetListsBeijing (Bird’s Nest) Day1 Day2 Folding Same as Left Salt of the Earth Same as Left Aliens Same as Left The Mask Same as Left I Don’t Care Same as Left Immortal Same as Left Flight Mode Same as Left Intermission Video Same as Left Qi Tian Same as Left Mayfly Same as Left I’m Here AKA I Really Want to Love This World Same as Left When the World Forgets Me Same as Left Glimmer Same as Left Orchestra Solo: Vivaldi’s “Winter” Same as Left Cover Songs Medley: Same as Left Lucky as You Same as Left Dancing Siren Same as Left Child Same as Left Wayfarer Same as Left Nunchucks Same as Left My Skateboard Shoes Same as Left Flammable and Explosive Same as Left Fake Monk Same as Left Do It While You Are Still Young Same as Left We are young Same as Left I am What I am Same as Left Cancer Same as Left Seven Personalities Same as Left Illusion and Reality Same as Left Bullfight Same as Left Madhouse Same as Left Flowers in a Small Town Same as Left Let’s Go and Watch the Sunrise We Meet When Flowers Fade Light Up the Bonfire at the Galaxy’s End Same as Left King and Beggar Growing Toward the Sun Growing Toward the Sun Let’s Go and Watch the Sunrise Shanghai Day1 Day2 Day3 Folding Same as Left Same as Left Salt of the Earth Same as Left Same as Left Aliens Same as Left Same as Left The Mask Same as Left Same as Left I Don’t Care Same as Left Same as Left Immortal Same as Left Same as Left Flight Mode Same as Left Same as Left Intermission Video Same as Left Same as Left Qi Tian Same as Left Same as Left Mayfly Same as Left Same as Left I’m Here AKA I Really Want to Love This World Same as Left Same as Left When the World Forgets Me Same as Left Same as Left Orchestra Solo: Vivaldi’s “Winter” Same as Left Same as Left Cover Songs Medley: Same as Left Same as Left Lucky as You Same as Left Same as Left Dancing Siren Same as Left Same as Left Child Same as Left Same as Left Wayfarer Same as Left Same as Left Nunchucks Same as Left Same as Left My Skateboard Shoes Same as Left Same as Left Flammable and Explosive Same as Left Same as Left Fake Monk Same as Left Same as Left Do It While You Are Still Young Same as Left Same as Left We are young Same as Left Same as Left I am What I am Same as Left Same as Left Seven Personalities Same as Left Same as Left Illusion and Reality Same as Left Same as Left Bullfight Same as Left Same as Left Madhouse Same as Left Same as Left Flowers in a Small Town Same as Left Same as Left Let’s Go and Watch the Sunrise Same as Left Sea of Wind Light Up the Bonfire at the Galaxy’s End Same as Left Same as Left Growing Toward the Sun Sea of Wind Growing Toward the Sun King and Beggar Same as Left Same as Left Conversations with Martian Children Ashes from Fireworks We Meet When Flowers Fade Why Nobody Fights Growing Toward the Sun Let’s Go and Watch the Sunrise Nanjing Nanjing Folding Salt of the Earth Aliens The Mask I Don’t Care Immortal Flight Mode Intermission Video Qi Tian Mayfly I’m Here AKA I Really Want to Love This World When the World Forgets Me Orchestra Solo: Vivaldi’s “Winter” Cover Songs Medley: Lucky as You Dancing Siren Child Wayfarer Nunchucks My Skateboard Shoes Flammable and Explosive Fake Monk Do It While You Are Still Young We are young I am What I am Seven Personalities Illusion and Reality Bullfight Madhouse Flowers in a Small Town Sea of Wind Light Up the Bonfire at the Galaxy’s End For Forever Growing Toward the Sun King and Beggar We Meet When Flowers Fade Let’s Go and Watch the Sunrise Guangzhou Day1 Day2 Folding Same as Left Salt of the Earth Same as Left Aliens Same as Left The Mask Same as Left I Don’t Care Same as Left Immortal Same as Left Flight Mode Same as Left Intermission Video Same as Left Qi Tian Same as Left Mayfly Same as Left I’m Here AKA I Really Want to Love This World Same as Left When the World Forgets Me Same as Left Orchestra Solo: Vivaldi’s “Winter” Same as Left Cover Songs Medley: Same as Left Lucky as You Same as Left Dancing Siren Same as Left Child Same as Left Wayfarer Same as Left Nunchucks Same as Left My Skateboard Shoes Same as Left Flammable and Explosive Same as Left Fake Monk Same as Left Do It While You Are Still Young Same as Left We are young Same as Left I am What I am Same as Left Seven Personalities Same as Left Illusion and Reality Same as Left Bullfight Same as Left Madhouse Same as Left Flowers in a Small Town Same as Left Extraordinary Ordinary Life Same as Left Light Up the Bonfire at the Galaxy’s End Same as Left Sea of Wind King and Beggar Ashes from Fireworks Growing Toward the Sun Growing Toward the Sun Sea of Wind We Meet When Flowers Fade Let’s Go and Watch the Sunrise","link":"/marsconcert2023-2/"},{"title":"Biography","text":"Hua Chenyu, a male singer and songwriter from the People’s Republic of China, who also works as an arranger. He graduated from Wuhan Conservatory of Music. Hua’s main nickname in the media is “Hua hua (花花)”, which means flower. However, most fans, regardless of age, refer to him as “Big Brother / Boss” (大哥). In September 2018, five years after his debut, Hua held a two-day personal concert at China’s largest stadium, the Beijing National Stadium (Bird’s Nest), becoming the first to do so among the singers born after 1990. Since 2021, Hua Chenyu has upgraded his personal concerts to outdoor rock festivals, each time builting a huge venue. The concert includes matinee and evening Show every day, as well as art installation and food street, attracting tens of thousands of spectators who dress up in flashy costumes and cosplay every day. They can enjoy a music carnival from afternoon to late night. Hua Chenyu Traditional Chinese: 華晨宇 Simplified Chinese: 华晨宇 Hanyu Pinyin: Huà Chén yŭ Place of Birth: Shiyan, Hubei Province, China Birth: February 7, 1990 Child: One daughter Biography Born on February 7, 1990, in Shiyan, Hubei Province, People’s Republic of China. Hua repeated his senior year of high school, and in 2010, he was admitted to his dream university - Wuhan Conservatory of Music, with the top score. In 2013, Hua debuted as the Champion of “Superboy 2013“, a musical talent competition which aims at uncovering talented tomorrow new male stars. In January 2014, Hua performed on the stage of The 2013 CCTV Spring Festival Gala (中国中央电视台春节联欢晚会). In September 2014, one year after his debut, Hua held a two-day personal concert with an audience of over 10,000 people at the Wukesong Arena in Beijing. In September 2014, Hua released his first album “Quasimodo’s Gift（卡西莫多的礼物）“. From July to August 2015, Hua held a three-day personal concert with an audience of over 10,000 people at the Shanghai Indoor Stadium. The personal concert on August 1st was broadcast in real time, recording 2.64 million online viewers. In December 2015, Hua released his second album “Aliens (异类)“. From July to September 2016, Hua held a three-day personal concert with an audience of over 10,000 people in Beijing, Shanghai, and Shenzhen. In December 2016, Hua won the Best Asian Artist Award at the 2016 Mnet Asian Music Awards. In March 2017, Hua released his third album “H“. In October 2017, Hua held a two-day personal concert with an audience of over 10,000 people at the Wukesong Arena in Beijing. The personal concert on October 14 was broadcast in real time, recording 2.64 million online viewers. In September 2018, five years after his debut, Hua held a two-day personal concert at China’s largest stadium, the Beijing National Stadium (Bird’s Nest), becoming the first to do so among the singers born after 1990. In November 2019, Hua held a three-day personal concert at the Wuyuan River Stadium on Hainan Island. About 80% of the audience came from outside Hainan Island. According to local reports, sales at the airport duty-free shop on the first day of the concert increased by about 67%, and the live concert had a significant economic impact on the local area. On December 4, 2019, Hua released the single “I’m Here AKA I Really Want to Love This World (好想爱这个世界啊)“, broking China’s digital single sales record and music app’s purchase record. On February 21, 2020, Hua premiered the single “You Have To Believe This Is Not the Last Day (你要相信这不是最后一天)“ on the China singing talent show contest “Singer 2020“ to support people who have been severely affected by COVID19. This work reflects his strong feelings towards his hometown of Hubei Province and Wuhan, where he spent time in high school and university. In April 2020, Hua was declared winner (AKA King of Singers) of “Singer 2020“. At the time of the program’s broadcast, Hua became the youngest “King of Singers” in history since the program aired. In May 2020, Hua released his fourth album “NEW WORLD“. (Note: the MV for one of the main songs, “Bullfight（斗牛）“, was produced by a Japanese production team, directed by Mitsunori Yokobori, and animated by Yoshiki Imazu.) In 2020, Hua opened a new SNS account “Mars Space Station (火星空间站)“ and started operating his art toy brand“Masper”. On January 21, 2021, rumors spread on the internet that Hua Chenyu and female singer Zhang Bichen have a 2-year-old daughter. The next day, Hua admitted that he has a daughter. Immediately afterwards, Hua’s studio commented to the media that “Hua Chenyu is currently single, and the two of them will raise their child together on the premise that they will not get married, and they will be both involved in the child’s growth process.” From November 26 to December 5, 2021, Hua held a six-day personal concert at the Changying Wonderland in Haikou, and premiered one new song each day, for a total of six new songs. Hua served as the general director of this concert and built a huge venue on the lawn square of the amusement park. The concert was in the form of a music festival without seats, and included two performances each day, “Matinee (2:07pm-4:30pm)” and “Evening Show (19:30pm-22:00pm)”. On September 25, 2022, Hua Chenyu held an online concert “Mars Chapter“ for the 9th anniversary of his debut, rearranged 11 songs in collaboration with a symphony orchestra and choir, and experienced orchestra conducting and acapella singing for the first time. The two-hour live broadcast exceeded 200 million online views. In December 2022, Hua released his fifth album “希忘Hope”. In 2023, Hua Chenyu held a live tour around China in the style of a rock festival. The theme of this tour is to take fans to the great rivers and mountains of the motherland, and Hua even promised an all-night sunrise concert. In the first half of the year, Hua has held a total of 11 live concerts in four cities: Hangzhou, Chengdu, Wuhan, and Changsha. NEW⇒On May 30, 2023, Hua Chenyu was certified by the Peace Elite League (PEL) under the ID of @花傲天, and officially registered with the Hangzhou LGD Team as a youth player (Attacker). The name “傲天” describes an arrogant, conceited, and invincible character that appears in Chinese internet novels and Japanese Comic. NEW⇒On September 9, 2023, Hua Chenyu once again held a two-day personal concert at the Beijing National Stadium (Bird’s Nest). The theme of this concert is a perfect report in which he looks back on the 10 years since his debut. This is Bird’s Nest’s first four-sided stage after the Olympic opening ceremony. The design and construction were also handled by the production team of the 2008 Beijing Olympic and 2022 Beijing Winter Olympic Opening and Closing Ceremonies, who are also Hua Chenyu’s fans. Naturally, Hua also set a record of 100,000 viewers for a single concert in China.","link":"/hcy-bio/"},{"title":"MARS CONCERT 2023 (First half)","text":"Time Location guest April 7th-9th Hangzhou Baima Lake Park Zuo Li April 30th - May 2nd Chengdu Open Air Music Park Zuo Li May 27th-28th Wuhan Garden Expo Park Zuo Li June 22th-24th Changsha Malanshan Yazui Park Zuo Li 1. Achievements In 2023, Hua Chenyu held a live tour around China in the style of a rock festival. The theme of this tour is to take fans to the great rivers and mountains of the motherland, and Hua even promised an all-night sunrise concert. In the first half of the year, there were a total of 11 days of performances in four cities: Hangzhou, Chengdu, Wuhan, and Changsha, and each day was still divided into Matinee and Evening Show, and the ticket price had not changed. The stage was also newly constructed and was even bigger than 2021. The stage for this tour was designed by the production team for the opening and closing ceremonies of the 2008 Beijing Olympics and 2022 Beijing Winter Olympics, and was expected to be the most expensive personal concert stage in China. The main stage was a 28m high “science fiction city” made up of giant art installations. By using mirrored single-transparent materials over a large area, the stage was completely integrated with the natural environment, and different magical effects appeared from different viewpoints and at different times. Sometimes it felt like a “mirage of the sea” and the stage has ``disappeared.’’ At night, 10 sets of huge mobile devices could move in various directions using the cross tracks on the stage, dividing the stage into multiple spaces. Images and lighting were randomly refracted in different spaces made up of mirror surfaces, and different effects could be seen from different positions, creating an ever-changing effect. The “Planet” stage was like a “interstellar device” of the “Martian civilization”, and the extension platform connected to the main stage penetrated the audience seats as a “Martian civilization” corridor. These spatial structures were surrounded by giant ring devices that resemble planetary orbits. According to the intention of each song, the circular orbit could create laser shows, artificial snowfall and other romantic miracles. » Stage Design Photo Gallery « » Poster and Highlight Photo Gallery « 2. Anecdote ツアーの各都市の”火星スナックストリート”では、地元の名物料理が並んでいた。更に、長沙公演がたまたま中国の伝統的な端午節 (日本では”男の子の節句””Childの日”として定着している日)に開催されたため、粽 (ちまき)或いは緑豆餅が入った二種類のギフトセットが限定販売されていた。 各都市のプロモーションポスターは同じ写真を使用していだが、背景にはその都市のランドマークとなる建物が描かれていた。 A different sentence was printed each day on the long ribbon paper that was sprayed at the end of the performance: Translation Original Hangzhou Day1 Welcome Home! 春暖花开，欢迎回家！ Day2 Day3 Growing Toward the Sun！ 相信希望，向阳而生！ Chengdu Day1 Welcome Home! 火星降临，欢迎回家！ Day2 Fly to find the red meteor! 飞吧 去寻觅 红色的流星！ Day3 散场后，会不会忘了我！ Wuhan Day1 火星，我们，回家啦！ Day2 火星 让爱生长 让我们向阳！ Changsha Day1 ［梦］开始的地方~♥ Day2 我们一起寻找到最漂亮的愿望 Day3 火星，十年，鸟巢见！ Hangzhou Concert 2021年のMars Concertの数日前、浙江地域でCovid-19が突然発生して、この地域のfansが入園禁止或いは指定の隔離エリアで観覧しなければいけなくなってしまった。したがって、Hua Chenyuは2年ぶりのライブツアーの初日公演を、杭州で開催した。 杭州は10日連続で雨が降っていたが、ライブ公演の3日間だけは晴れになった。敷設に数千万元を要した芝生が雨で泥沼になってしまったが、仮設ビニール板が立てられて、靴カバーも適切に配布されて、泥沼は10万人以上のfansの熱狂を止めることができなかった。 コンサートステージを設営するための広大な空地は、ファンによって「火星大芝生」と名付けられ、中国で最も利用率が高い百度地図アプリに登録された。半年後もなお、ファンたちは時折この芝生を訪れて「火星の遺跡」を探し求める。例えば、「火星スナックストリート」に販売されたスイカの種から生えた小さなスイカなどだ。また、後から訪れるファンが「宝探し」を楽しむことができるように、芝生にさまざまな小さな記念品を隠すこともする。 » Hangzhou Concert Photo Gallery « Chengdu Concert 成都露天音楽公園は横幅180メートル、高さ50メートルで、約1万平方メートルの巨大な投影可能なドーム型天幕が備えられており、世界最大の、イマーシブオーディオを採用する半露天半室内両面劇場である。 Evening Showは19:30に開演予定でしたが、成都は中国の中西部に位置し、暗くなるのが遅いため、オープニングの最高の視覚効果を得るために30分以上遅らせて、空が暗くなってからライブを始めた。 » Chengdu Concert Photo Gallery « Wuhan Concert リハーサルの時、毎日数回の豪雨があって、天気予報も雨ばっかりだったから、主催者もfansも雨対策しかしていなかった。でも当日、35度を超える高温が襲来して、多くの観客が体調不良に陥った。Hua Chenyuは緊急に熱中症対策を行って、現場で販売されていた水を無料化し、多くの非食用氷を購入して砕いて観客席の各所に投げ入れ、大量のドライアイスを放出した。また、翌日のMatineeの開演時間を午後2時から4時に延期すると発表したが、演奏曲目は減らなかった。つまり、短縮されたのは彼自身の休憩時間のみ。その夜、Huaは外地から多台の工業用屋外空調扇を緊急に購入して、人口密度が最も高い内野エリアに設置した。 初日のEvening Show、会場である公園ではライブ現場だけが雨が降らず、他のエリアではシャワーが降ったという奇妙な光景が現れた。その前の杭州公演と成都公園も天気予報に反して、ライブの時だけが晴れていた。翌日のEvening Showで、火星が確かにミステリーな力があるとHua Chenyuは認めた。そして、おそらく”Growing Toward the Sun (向阳而生)“という曲を書いたから太陽に愛されていて、天気予報さえ自分には勝てないと、Huaは直接にアンチfansの中傷を返した。 翌日のMatineeで、”My Skateboard Shoes 2016 (我的滑板鞋2016)“を歌っている時に”Welcome to China”と言い、初めて外国のfansに対する歓迎の意を公に表した。 » Wuhan Concert Photo Gallery « Changsha Concert 公演前の数日間、ほぼ毎日数回の大雨が降った。更に、Hua Chenyuはリハーサルのvlogで涼しくするために雨を祈った。結果的に3日間の公演は全て雨の中で行われた。Matineeでは、自ら透明傘をさしてパフォーマンスした。 長沙市の規定によって公演が9時30分に終了しなければならないので、開演時間は30分早かった。その結果、最初の1時間は空がまだ非常に明るかったため、ステージとレーザーの視覚効果は大幅に軽減されました。 アンコールで流れたビデオ (デビュー十年の振り返りとBird’s Nestコンサートの予告)は、スタッフがHua Chenyuに内緒で用意したサプライズだった。ビデオのナレーションは、十年前のデビュー番組”Superboy 2013”の人気司会者 / 何炅 (ホー / ジョン)が担当した。 最終公演終了から約1時間後、Hua Chenyuは”コンサートの後遺症”を軽減するためにいきなり生放送を開始して、串を食べながらfansとおしゃべりをしてくれた。後はZuo Liも参加した。舞台セットや気に入りのコスチュームやステージ名場面の誕生などについて語っていた。 » Changsha Concert Photo Gallery « 3. VideosOfficial Video“Growing Toward the Sun (向阳而生)” Hangzhou Concert - April 9th “Illusion and Reality (虚幻与现实)” Hangzhou Concert - April 9th “Light Up the Bonfire at the Galaxy’s End (点燃银河尽头的篝火)” Chengdu Concert - May 2nd “When the World Forgets Me (当全世界忘了我)” Chengdu Concert - May 2nd “God Tree (神树)” Wuhan Concert - May 28th “Madhouse (疯人院)” Wuhan Concert - May 27th “Let’s Go and Watch the Sunrise (走，一起去看日出吧)” Changsha Concert - June 24th “Seven Personalities (七重人格)” Changsha Concert - June 22nd 4. SetListsHangzhouDay1 - April 7th Matinee Evening Show Great Sage Equal To Heaven God Tree I Don’t Care Aliens Seek Let You Go IQ250 Flight Mode Improvisation Here We Are Through My Heart Seven Personalities The Return of the Master Searching for Myself Do It While You Are Still Young I’m Here AKA I Really Want to Love This World The World is a Zoo Madhouse Immortal Flowers in a Small Town Happy Birthday to You Ashes from Fireworks Bedside Story Arrival Sichuan Mahjong Competition Black and White Artist Miles Away From Loneliness Illusion and Reality My Skateboard Shoes 2016 Jackdaw Boy Bullfight When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Conversations with Martian Children Day2 - April 8th Matinee Evening Show To Be Free Qi Tian Bomb Squad Aliens Seek Let You Go I’m Boring Flight Mode I Don’t Care Here We Are Through My Heart Seven Personalities Do It While You Are Still Young Searching for Myself Rampage I’m Here AKA I Really Want to Love This World The World is a Zoo Madhouse Miles Away From Loneliness Flowers in a Small Town Happy Birthday to You Quasimodo’s Gift Bedside Story Wayfarer Original Singer: No Party For Cao Dong Sichuan Mahjong Competition Black and White Artist Ashes from Fireworks Illusion and Reality Immortal Jackdaw Boy Bullfight When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar New World Day3 - April 9th Matinee Evening Show I Don’t Care God Tree Great Sage Equal To Heaven Aliens Seek Let You Go IQ250 Flight Mode Bomb Squad Here We Are Through My Heart Seven Personalities The Return of the Master Searching for Myself Do It While You Are Still Young I’m Here AKA I Really Want to Love This World The World is a Zoo Madhouse Immortal Flowers in a Small Town Happy Birthday to You Quasimodo’s Gift Ashes from Fireworks Arrival Sichuan Mahjong Competition Nunchucks Original Singer: Jay Chou Miles Away From Loneliness Black and White Artist My Skateboard Shoes 2016 Illusion and Reality Bullfight When the World Forgets Me We Meet When Flowers Fade Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever New World King and Beggar Let’s Go and Watch the Sunrise ChengduDay1 - April 30th Matinee Evening Show Great Sage Equal To Heaven God Tree I Don’t Care Aliens Seek Let You Go Bomb Squad Flight Mode Through My Heart Here We Are Do It While You Are Still Young Seven Personalities The World is a Zoo Searching for Myself Bedside Story I’m Here AKA I Really Want to Love This World Happy Birthday to You Madhouse Sichuan Mahjong Competition Flowers in a Small Town Miles Away From Loneliness Quasimodo’s Gift Mobile game Competition“Game For Peace” WayfarerOriginal Singer: No Party For Cao Dong Ashes from Fireworks Black and White Artist Flying Conductor Illusion and Reality Jackdaw Boy Bullfight When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Why Nobody Fights Day2 - May 1st Matinee Evening Show Bomb Squad God Tree IQ250 Aliens My Skateboard Shoes 2016 Let You Go I Don’t Care Flight Mode The Return of the Master Here We Are Do It While You Are Still Young Seven Personalities The World is a Zoo Searching for Myself Immortal I’m Here AKA I Really Want to Love This World Happy Birthday to You Madhouse Sichuan Mahjong Competition Flowers in a Small Town Bedside Story Quasimodo’s Gift mobile game Competition“Game For Peace” Arrival Ashes from Fireworks Nunchucks Original Singer: Jay Chou Iconic moment Black and White Artist Illusion and Reality Bullfight When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Day3 - May 2nd Matinee Evening Show I Don’t Care God Tree Great Sage Equal To Heaven Aliens IQ250 Let You Go My Skateboard Shoes 2016 Flight Mode Through My Heart Here We Are Do It While You Are Still Young Seven Personalities The World is a Zoo Searching for Myself Bedside Story I’m Here AKA I Really Want to Love This World Happy Birthday to You Madhouse Sichuan Mahjong Competition Flowers in a Small Town Immortal Quasimodo’s Gift mobile game Competition“Game For Peace” Arrival Miles Away From Loneliness Lucky as YouOriginal Singer: Constant &amp; Change Flying Conductor Black and White Artist Iconic moment Illusion and Reality Bullfight When the World Forgets Me We Meet When Flowers Fade Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever New World King and Beggar Let’s Go and Watch the Sunrise WuhanDay1 - May 27th Matinee Evening Show Great Sage Equal To Heaven God Tree I Don’t Care Aliens Seek Let You Go IQ250 Flight Mode Bomb Squad Here We Are Through My Heart Seven Personalities Do It While You Are Still Young Searching for Myself The World is a Zoo I’m Here AKA I Really Want to Love This World Contra in the Wild Madhouse Bedside Story Flowers in a Small Town Happy Birthday to You Quasimodo’s Gift Sichuan Mahjong Competition WayfarerOriginal Singer: No Party For Cao Dong Miles Away From Loneliness Black and White Artist Immortal Illusion and Reality Jackdaw Boy Bullfight When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Day2 - May 28th Matinee Evening Show I Don’t Care God Tree Great Sage Equal To Heaven Aliens IQ250 Let You Go Bomb Squad Flight Mode The Return of the Master Here We Are Do It While You Are Still Young Seven Personalities Immortal Searching for Myself Miles Away From Loneliness I’m Here AKA I Really Want to Love This World Happy Birthday to You Madhouse Ashes from Fireworks Flowers in a Small Town My Skateboard Shoes 2016 Quasimodo’s Gift Arrival Lucky as YouOriginal Singer: Constant &amp; Change Black and White Artist Illusion and Reality Bullfight When the World Forgets Me We Meet When Flowers Fade Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Let’s Go and Watch the Sunrise ChangshaDay1 - June 22th Matinee Evening Show Great Sage Equal To Heaven God Tree I Don’t Care Aliens Seek Flight Mode IQ250 Here We Are Bomb Squad Seven Personalities Through My Heart Searching for Myself Do It While You Are Still Young I’m Here AKA I Really Want to Love This World Immortal Madhouse Miles Away From Loneliness Flowers in a Small Town Lucky as YouOriginal Singer: Constant &amp; Change Quasimodo’s Gift Ashes from Fireworks WayfarerOriginal Singer: No Party For Cao Dong Happy Birthday to You Black and White Artist My Skateboard Shoes 2016 Illusion and Reality Bullfight When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Day2 - June 23th Matinee Evening Show Bomb Squad God Tree IQ250 Aliens Seek Flight Mode I Don’t Care Here We Are My Skateboard Shoes 2016 Seven Personalities The Return of the Master Searching for Myself Do It While You Are Still Young I’m Here AKA I Really Want to Love This World The World is a Zoo Madhouse Improvisation Flowers in a Small Town Miles Away From Loneliness Quasimodo’s Gift Bedside Story Arrival Happy Birthday to You Nunchucks Original Singer: Jay Chou Immortal Black and White Artist Illusion and Reality When the World Forgets Me We Meet When Flowers Fade Let’s Go and Watch the Sunrise Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Day3 - June 24th Matinee Evening Show I Don’t Care God Tree Great Sage Equal To Heaven Aliens Seek Flight Mode IQ250 Here We Are Bomb Squad Seven Personalities The Return of the Master Searching for Myself Do It While You Are Still Young I’m Here AKA I Really Want to Love This World Somebody that I used to know Madhouse Bedside Story Flowers in a Small Town Happy Birthday to You Quasimodo’s Gift Miles Away From Loneliness Arrival My Skateboard Shoes 2016 Lucky as YouOriginal Singer: Constant &amp; Change Black and White Artist Illusion and Reality When the World Forgets Me We Meet When Flowers Fade Growing Toward the Sun Light Up the Bonfire at the Galaxy’s End ](/05-09-milkyway/) For Forever King and Beggar Let’s Go and Watch the Sunrise","link":"/marsconcert2023-1/"},{"title":"Superboy 2013 - Hua&#39;s debut show","text":"In 2013, Hua Chenyu participated in China’s most popular musical talent competition “Superboy 2013” and debuted as the champion. 1. About the show“Super Girl (超级女声)” was the most successful musical talent competition series in China, and “Superboy (快乐男声)” was the boy version of this series.The show aired weekly games live on TV, and also had players broadcast their dormitory life online, 24 hours a day, without interruption. The 2,000 square meter villa where 15 players lived was equipped with 70 cameras, making it a veritable 360-degree reality show with no blind spots. 2. Playlist“Superboy 2013” Full Versionhttps://www.youtube.com/playlist?list=PLUM8x224JrX_SVS1OxZs9YlkkfyhiDvsw 3. Anecdote A fan gave him a huge stuffed bear. Hua took off the T-shirt the doll was wearing, and put it on himself. One time Hua couldn’t find a rice spoon, so he just used the bowl in his hand to scoop rice from the rice cooker. Love playing the piano in the hall of the villa. Hua almost retired from the show because he couldn’t get used to the loss of freedom and the public attention. But the director dissuaded him and said,”Anyway, once the show is over, your popularity will drop. There’s no way you’ll become a top idol, so don’t worry” So he persisted until the end and won the championship. 4. Detailed information about each episodePreselection in Changsha DivisionJune 29, 2013Repertoire: “Lyricless Song“Original Singer: Hua Chenyu Hua’s first TV appearance.With his bare face, a T-shirt, and a keyboard, Hua sang an original song with no title or lyrics in a mysterious atmosphere. He received approval from all three judges, passed the preliminaries directly and qualified to compete for the top 20 in the country. After that, “Lyricless Song“ became Hua’s symbol and ignited the Chinese entertainment industry in 2013, along with his first nickname “Little Bro. Martian (火星弟弟)”. Competition for the TOP 20 in the countryJuly 12, 2013Repertoire: The KillOriginal Singer: 30 seconds to mars Competition for the TOP 10 in the countryAugust 2, 2013Repertoire: Somebody that I used to knowOriginal Singer: Gotye, Kimbr TOP10 to TOP9August 9, 2013Repertoire: I Am What I Am (我)Original Singer: Leslie Cheung TOP9 to TOP8August 16, 2013Repertoire: We are youngOriginal Singer: fun. TOP8 to TOP7August 23, 2013Repertoire: Dear Child (亲爱的小孩)Original Singer: Julie Sue TOP7 to TOP6August 30, 2013Repertoire: Fake Monk (假行僧)Original Singer: Cui Jian As an amateur, Hua Chenyu stood on the stage barefoot and performed this 1990s Chinese rock masterpiece in a psychedelic rock style.Five years later, Hua Chenyu re-arranged this song at China singing talent show contest “Singer 2018“, and gave the audience a shocking performance with a completely different atmosphere, showing his growth. TOP6+1 to TOP6September 6, 2013Repertoire: Poker FaceOriginal Singer: LADY GAGA Hua’s first dance performance. ლ(╹◡╹ლ) TOP6 to TOP5September 13, 2013Repertoire: the star (小星星)Support Guest &amp; Original Singer: Laure Shang TOP5 to TOP3September 20, 2013 Repertoire: White Autumn (白色秋天)Support Guest &amp; Original Singer: Yico Zeng “I’m not a genius. I just started working hard earlier than others, and then put my best state directly on this stage at once, so that you can directly see my best state. PK Round: Provocation (挑衅)Original Singer: Shin Band FinalsSeptember 27, 2013 Round 1Repertoire: Red Bean (红豆)Original Singer: Faye Wong Round 2Repertoire: Mr. Lonely (寂寞先生)Support Guest &amp; Original Singer: Gary Chaw Round 3Repertoire: I Will Always Love YouOriginal Singer: Dolly Parton When finished singing, Hua said, “Dad, I love you.” Round 4Repertoire: Boundless Oceans, Vast Skies (海阔天空)Original Singer: Beyond","link":"/2013boy/"},{"title":"Singing Talent Show Contest &quot;Singer 2018&quot;","text":"In February 2018, Hua Chenyu participated in Hunan TV’s singing talent show contest “Singer 2018” as a filled-in contestant. Hua fought until the finals and won second place. 1. About the showAccording to the regulations, each contestant can only sing up to 3 of his original songs. In other words, they mainly have to perform cover songs. Therefore, the two problems of the contest are how to choose the songs and how to rearrange the songs.The performance will be evaluated by the 500 audience members of the public audience at the venue. Audience members was selected strictly and equally from each age group via a questionnaire, and in theory, contestant’ fans are prohibited from being selected.Every year, the final winner receives the title of “King of Singers”. 2. Playlist“Singer 2018” Full Version (Only for Channel’s M2VIP Menber):https://www.youtube.com/playlist?list=PLUM8x224JrX9s65DIWbPGliUwfm23KlMN Hua’s Performances:https://www.youtube.com/watch?v=tb2NMFnbfoY&amp;t=385s 3. Detailed information about each episodeEP4 (first appearance)February 2, 2018Repertoire: Qi Tian (齐天)Original Singer: Hua ChenyuRanking: 1 This is his first appearance as a filled-in contestant! Ended Jessie J’s winning streak.Received a Flowers With Smiley Faces badge (Takashi Murakami) presented by his exclusive MC Li Weijia. Hua have been wearing it on his chest ever since! EP5February 9, 2018Repertoire: Child (孩子)Ranking: 3Original Singer: Xi Lou (Composer of Hua’s original song”Ashes from Fireworks (烟火里的尘埃)“) Added the melody of “Ashes from Fireworks (烟火里的尘埃)“to the interlude. EP6February 16, 2018Repertoire: Nunchucks (双截棍)Original Singer: Jay ChouRanking: 1 The broadcast date of EP6 happens to be the first day of the Chinese Lunar New Year. EP7February 23, 2018Repertoire: I Don’t Care (我管你)Original Singer: Hua ChenyuRanking: 1 This time was a Re-Mix version that emphasized the bass in the intro. EP8March 9, 2018Repertoire: Flammable and Explosive (易燃易爆炸)Original Singer: Chen LiRanking: 3 During the rehearsal, Hua suddenly learned of the death of Lyricist Shang Mengdi, and he changed his scheduled performance to this song at the last minute.However, due to the program’s self-regulation, several parts of the lyrics were changed. EP9March 16, 2018Repertoire: WayfarerOriginal Singer: No Party For Cao DongRanking: 5 Personal lowest ranking. This rearrangement was a very controversial one. EP10March 23, 2018Repertoire: Fake Monk (假行僧)Original Singer: Cui JianRanking: 2 An experimental-voice music using just one piano. EP11March 30, 2018Repertoire: The Ordinary Path (平凡之路)Original Singer: Pu ShuRanking: 2 Hua added the melody of his original song “Mayfly (蜉蝣)“ by humming it.This is Hua’s first time trying long hair styling. EP12April 6, 2018Repertoire: I Am What I Am (我)Original Singer: Leslie CheungRanking: 1 A song that has a special meaning for Hua and that he only has the strength to sing it once a year. EP13 FinalsApril 13, 2018 Round 1Repertoire: Light Years Away (光年之外)Support Guest &amp; Original Singer: G.E.M.Ranking: Reached the Round 2 Round 2Repertoire: Shouts (呐喊)Original Singer: Angela ZhangRanking: Runner-up This song has been rearranged in a completely different style from the original version.Later, Hua was able to create a new original work based on this song, namely “New World“, the title song of his 4th album. After-partyApril 20, 2018Repertoire: Glimmer (微光)Original Singer: Hua Chenyu Because Hua didn’t know that there was a live broadcast camera set up backstage, he accidentally said that, his track had been changed by the program in the last-minute before going on stage. This conversation was edited out during the replay.The song performed during the rehearsal was “somebody that I used to know” Live broadcast of After-party’s backstage","link":"/singer2018/"},{"title":"Singing Talent Show Contest &quot;Singer 2020: The Prime&quot;","text":"In February 2020, Hua Chenyu participated in Hunan TV’s singing talent show contest “Singer 2020: The Prime”, and won the championship (AKA King of Singers). 1. About the showAll the singers invited to this years’s show were young people who were at the peak of their careers, so there were no rules and it was okay for them to sing their original songs. And MISIA, a female singer from Japan, also participated.EP1 was scheduled to be broadcast on January 31st, but the broadcast date was changed to February 7th in order to prioritize COVID-19 news programs.Not only was it postponed, but starting from EP3 on February 27th, the singers began recording in their respective contries and cities to prevent the spread of COVID-19.The 500 audience judges did not need to go to the venue, but watched the live broadcast and voted online at their respective homes. This was the first time in the show’s eight-year history. 2. Playlist“Singer 2020” Full Version:https://www.youtube.com/playlist?list=PLUM8x224JrX8bqnBusTwa6MKkhguCvtWk) Hua’s Performances:(https://www.youtube.com/playlist?list=PLXgUykwqp2GR73RS98XVMx9CNif0ohgdv) 3. Detailed information about each episodeEP1February 7, 2020Repertoire: Jackdaw Boy (寒鸦少年)Original Singer: Hua ChenyuRanking: 1 EP2February 14, 2020Repertoire: Bullfight (斗牛)Original Singer: Hua ChenyuRanking: 1 EP3February 21, 2020Repertoire: You Have To Believe This Is Not the Last Day (你要相信这不是最后一天)Original Singer: Hua ChenyuRanking: 2 A charity song to support people who have been severely affected by COVID19. This work reflects Hua’s strong feelings towards Wuhan, where he spent time in high school and university and was considered as his second hometown.In this episode, this song was released for the first time.At the end of the song, several celebrities each offered words of comfort and encouragement in their local dialects. EP4February 28, 2020Repertoire: Contra in the Wild (荒野魂斗罗)Original Singer: Hua ChenyuRanking: 3 To accommodate studio live broadcasts without an audience, Hua tried the Unplugged format. Together with his best friend Zuo Li, he stayed up all night to complete the rearrangement. EP5March 6, 2020Repertoire: Us (我们)Original Singer: Eason ChanRanking: 1 Hua tried another new method of camera movement. By keeping the camera facing his face, he evoked the feeling of a face-to-face conversation.In a backstage interview, Hua said, “This is a song for the person I lost a long time ago, and I will never sing it again.” EP6March 13, 2020Repertoire: God Tree (神树)Original Singer: Hua ChenyuRanking: 5 This song uses a minimalist and cold style to outline a doomsday scene of complete silence, tsunamis and landslides. Perhaps it’s this superior look down that alienates the audience.Hua was wearing an all-black outfit. EP7March 20, 2020Repertoire: Arrival (降临)Original Singer: Hua ChenyuRanking: 6 A song that follows God Tree (神树). A chant that feels like new life is starting to sprout in the destroyed earth. First released at Mars Concert 2018 on September 8, 2018.The clothes this time were all white, which formed a cycle of Yin Yang and Tai Chi with the all black in the previous episode. EP8March 27, 2020Repertoire: New World (新世界)Original Singer: Hua ChenyuRanking: 3 An original song created based on the cover song Shouts (呐喊) that was performed on “Singer 2018“. EP9April 3, 2020Repertoire: I’m Here AKA I Really Want to Love This World (好想爱这个世界啊)Original Singer: Hua ChenyuRanking: 2 A work that calls for a better understanding of the feelings of depressive disorder patients.First released at Mars Concert 2019 on November 16, 2019. EP10April 10, 2020Repertoire: Obsessive Compulsive Disorder (强迫症)Original Singer: Hua ChenyuRanking: 1 Due to the program’s self-regulation, the title of the song was changed from “Madhouse (疯人院)” to “Obsessive Compulsive Disorder”.This song was first released at [Mars Concert 2019] on November 15, 2019.If the concert version was a carnival of a group of madmen, then this version was a monologue of a lonely madman on a stage without an audience. EP11April 24, 2020 Round 1Repertoire: West Gate Youth (西门少年)Support Guest &amp; Original Singer: Chris LeeRanking: Reached the Round 2 Hua and senior singer Chris Lee, who debuted 15 years ago from the same series of musical talent competition, performed Lee’s famous song “West Gate Youth (西门少年)” together. Round 2Repertoire: Gotham (歌谭)Original Singer: Hua ChenyuRanking: Champion Due to the program’s self-regulation, the title of the song was changed from “Seven Personalities (七重人格)” to “Gotham”.This song was first released at [Mars Concert 2019] on November 17, 2019.During the performance, Hua’s black cloak was removed to reveal a blood-red suit punctured with dense arrows.","link":"/singer2020/"},{"title":"Bullfight (斗牛)","text":"1. About the songFirst released at Mars Concert 2018 on September 8, 2018.Officially released on September 12, 2014. As a hard-hitting track in Hua Chenyu’s fourth solo album “NEW WORLD“, expresses a unique perspective on the debate of mankind’s relationship with nature and the awe and respect towards the vigorous tenacity of life. and a discussion of the relationship between man and nature and awe of life and natural forces with a different philosophical perspective. This is a song that portrays the philosophical complexion of recurrent natural forces and a song that conveys encompassing love towards all life. His writing of is the longest period Hua Chenyu had taken to compose a song. It took an entire month in alternating bursts of intense composing at the piano and long periods of rest and clearing of his mind. The lyrics describe the barbarity of mankind in contrast with the pureness of an untamed soul. The bullfighter uses a spear to pierce the flesh of the bull to enrage and incite its feral attacks and in the end, kills it thereby demonstrating the superiority and nobleness of humanity. To Hua Chenyu, “Bullfight” is a sorrowful struggle with no winner. Whichever side that wins, bullfighter or bull, the other faces death. The song utilizes brutal satire to invoke introspection on life itself condensed into a Bullfight scene, and at the end gives us his answer: “Following our kind nature – the last pride and chance for the victory of mankind” in hopes of reawakening and resonating with the listeners’ inherent propensity for kindness. The MV is envisioned by Hua Chenyu and presented in a combination of CG and animation. At the shooting site of the MV, there is only Hua Chenyu acting on his lonesome, using his immersive imagination to achieve the actions and atmosphere required by the director. To convincingly act as a bullfighter, the director arranged for a Spanish coach to teach Hua Chenyu the professional moves of a bullfighter and guide his pose and movements in “Bullfight” scenes. Hua Chenyu was an eager and quick learner, and sweat and grinding hard work went behind every simple flick of the red cloth. The MV was produced by a Japanese production team, directed by Mitsunori Yokobori, and animated by Yoshiki Imazu. On February 14, 2020, Hua Chenyu enthusiastically sang “Bullfight (斗牛)”, the main song of his unreleased 4th album “NEW WORLD“, on EP2 of the Singing Talent Show Contest “Singer 2020“. On September 25, 2022, at the online concert “Mars Chapter“ celebrating the 9th anniversary of his debut, Hua Chenyu rearranged 11 songs in collaboration with a symphony orchestra and a choir. 2. VideosListen OnlineSpotify MV “Mars Chapter” Symphony “Singer 2020” EP2 Mars Concert 2019 3. Lyrics TranslationLyricist: Pei YuCompose: Hua ChenyuArrange: Bernard Zheng、Hua Chenyu MV Director: Mitsunori YokoboriMV Animation Yoshiki Imazu 斗牛 Bullfight Follow follow 嘿 Follow Follow Hey 排着队 Bullfighters parade in 担起斗士的称谓 In the name of the fighters 先生们尊贵永不褪 The chivalry of the señores never dies 伊比利亚的壮美 The magnificence of Iberia 烈日空气被撕碎 The air has been shredded under the scorching sun 万人场共舞举杯 Tens of thousands of people dance and celebrate 攻克下沙场丰碑 Triumph on the battlefield for the trophy 暗藏的谋虑可贵 Concealed strategies are valued Mer MER~(Mer = the lowing, or mooing, or bellowing of a bull) 跟着我们 Mer Follow us MER~ Follow follow 嘿 Follow Follow Hey 等着谁 Whom are you waiting for? 请牛栏推列出位 Please get the bull ready for entering the ring 庄严神圣彼此敬畏 Solemnly and sacredly they pay mutual respect 昂起胸鞠躬交会 Straightening their posture They then bow to each other 绸制红衣镶金穗 Golden embroidery on red silk suits 侧颜杀刺透光锐 Undeterred bravery shining through their side silhouettes 猛然间号角齐吹 Trumpets suddenly blast 竞技场席卷沙灰 The arena is filled with swirling dust Mer MER~ 跟着我们 Mer Follow us MER~ 绕场引逗它飞奔不休 Taunted all around the field , it runs endlessly 战上几个回合霸气泄露 After a few rounds of battle, dominance radiates 长矛手卡准节奏 The picador gallops in to the rhythm of the beat Mer MER~ 跟着我们 Mer Follow us MER~ 刺扎背部它血管爆破 The back is pierced and veins burst open 激怒过后立刻凶暴如仇 The enraged bull is as ferocious as a demon 花镖手插上金钩 The banderillero plants in the banderillas Mer MER~ 跟着我们 Mer Follow us MER~ 重复贝卡尼卡动作 Repeat the Verónica 野性袒露着灵魂纯粹 Wildness bares the purity of the soul 或者肆意妄为 Or its recklessness 直到亲手栽培了原罪以后 After nurturing the original sin 又要将它摧毁 The very same hands now seek to destroy it Follow follow 嘿 Follow Follow Hey 扬着眉 Heads held high 迎面冲用力刺怼 A full-frontal thrust with all his might 直到心脏骤停而归 Till its heart stops beating and collapses 十字剑候补装备 A sword with a crosspiece is readied should a last blow be necessary 混合着庆典余味 Mixed with the aftertaste of the feast 血泊里没有眼泪 There are no tears in the pools of blood 公牛被花车拖回 The bull is dragged back by a flower-adorned cart 将野蛮众目睽睽 Savagery on full display Mer MER~ 跟着我们 Mer Follow us Mer~ Follow follow 嘿 Follow Follow Hey 咧着嘴 Wide smiles 尸首气味中陶醉 Reveling in the smell of the carcass 白色手帕全场狂挥 Fervently waved white handkerchiefs fill the air 牛耳被斗士捧回 Bull ears are carried by the matadors 王子门称为之最 The best one passes under the Prince’s Gate 原来他一生在追 It turns out thathe has been chasing after this his entire life 对生命致以敬畏 Pay tribute to and respect all lives 无论是什么地位 Regardless of stature Mer MER~ 跟着我们 Mer Follow us MER~ 绕场引逗它飞奔不休 Taunted all around the field, it runs endlessly 战上几个回合霸气泄露 After a few rounds of battle, dominance radiates 长矛手卡准节奏 The picador gallopes in to the rhythm of the beat Mer MER~ 跟着我们 Mer Follow us MER~ 刺扎背部它血管爆破 The back is pierced and veins burst open 激怒过后立刻凶暴如仇 The enraged bull is as ferocious as a demon 花镖手插上金钩 The banderillero plants in the banderillas Mer MER~ 跟着我们 Mer Follow us MER~ 重复贝卡尼卡动作 Repeat the Verónica 野性袒露着灵魂纯粹 Wildness bares the purity of the soul 或者肆意妄为 Or its recklessness 直到亲手栽培了原罪以后 After nurturing the original sin 又要将它摧毁 The very same hands now seek to destroy it 近看 Watch closely 放大镜下的人在逃窜 Men are scattering under the magnifying glass 人与自然平衡不了用偏执面决断 Nature and humankind are not in balancePrejudice makes the decisions 后患 Dangers are set in the future 这里的每团热血 For every splash of hot blood here 通电过后体征都在预料内不沸腾不欢 Nerves tingle as anticipated after that electrifying momentSatisfaction is only found in the blood boiling within 是梦幻成就艺术宫殿 Dream-like illusions build the palace of art 致美惨烈合二为一有无法分割的审美习惯 Where beauty and cruelty merge as oneThere lies a norm inseparable from aesthetics 若互换 进不去 艺术家的脑回旋 If they are swappednone can enter the swirling mind of an artist 只有一半的机会将勇猛玩转 There is only half a chance to tame the bold and powerful 试探 我们的叫声有多尖 To gauge how piercing our screams are 耳朵能承受的分贝在人为的环境多险 How risky the bearable level of decibels is in this man-made world 像触电 Like an electric shock 多巴胺分泌的动荡 a reverberation of dopamine secretion 安插在每个细节 Placed in every single detail 万众炒捧命悬一线 Hailed by millions Life hanging by a thread 太混乱 生命本就该循环 Too chaotic Life is meant to cycle 祷告将恶魔终结 Praying for the devil’s demise 假想出风轻云淡 Imagining serenity and calm 性向善 Following our kind nature 才是人类最后的骄傲和胜算 the last pride and chance of the victory of mankind","link":"/04-01-bullfight/"},{"title":"Jackdaw Youth (寒鸦少年)","text":"1. About the songOfficially released on September 12, 2014.The theme song of TV Drama “Battle Through the Heaven”Included in the 4th album”NEW WORLD“. As Kafka himself points out, the name “Kafka” “The boy named Crow” (“Kafka” sounds like “kavka”, which means “jackdaw”, a crow-like bird, in Czech). Jackdaw is harbingers of protection, warning, and advice. More specifically, they signify wisdom that feels as if it is coming from an inner voice or conscience. Producer Bernard Zheng arranged the song with layered effect, uncomplicated orchestration, and absolutely explosive musical performance. To organize the progressive relationship of rock and roll. On February 7, 2020, Hua Chenyu performed on EP1 of the Singing Talent Show Contest “Singer 2020“. On September 25, 2022, at the online concert “Mars Chapter“ celebrating the 9th anniversary of his debut, Hua Chenyu rearranged 11 songs in collaboration with a symphony orchestra and a choir. 2. VideosListen OnlineSpotify MV “Mars Chapter” Symphony “Singer 2020” EP1 3. Lyrics TranslationLyricist: Ding YanxueCompose: Hua ChenyuArrange: Bernard Zheng、Hua Chenyu 寒鸦少年 Jackdaw Youth 像一出默剧 Like a mime play 视线有雾气 the vision is blurred by fog 试探的证据 Evidence of sneaky prying 暴晒很彻底 is fully exposed under the sun 月光正坐下在祷告 Moonlight is settling down and praying 乌鸦张开嘴巴 Crows open their mouth 嘴巴 嘴巴 Mouth Mouth 我收拾好骄傲 I pack up my pride 原谅脆弱的玩笑 and forgive the lame jokes 走吧 走吧 Just go Just go 别随便歌颂 Don’t exalt heedlessly 我拉开了双拳 I raise my fists in a fighting stance 瞄准沸腾的时间 Aiming at the raging time 走吧 走吧 Just go Just go 别大声反驳 Don’t dispute loudly 在等我巡游 Waiting for me to cruise around 变暗的字轴 fading calligraphy scrolls and 终场的困兽 trapped beasts in the final round 当决斗问候 When the duel sends its greetings to – 焦黑的烟斗 charred smoking pipes 乱线的图谋 and tangled lines of ploys 向暴戾迎击 Fight against tyranny head-on 收敛起稚气练习 Rein in childish practice 再反转 意料和预谋 Then reverse anticipations and premeditations 扮生旦净丑 Playing all kinds of roles 谁恶意搀扶 who assists with malice? 放暗箭带路 Guides while backstabbing 屈辱当药服 Take humiliation as medicine 谢谢你让我都看透 Thank you for letting me see through everything 别当我是傻瓜 Don’t take me as a fool 傻瓜 傻瓜 A fool A fool 世界太长 时间太短 The world is too long and time too short 有什么值得庆祝 What is there that is worth a celebration 来不及回顾 It’s too late to look back 忘记有归途 I have forgotten that there are returning paths 最难是把自己驯服 The hardest is to tame oneself 想哭时不如停住 It is better to stop when one wants to cry 倒流的泪会变得坚固 Back-flowing tears will turn solid 去守护 to guard and protect 我收拾好骄傲 I pack up my pride 原谅脆弱的玩笑 and forgive the lame jokes 走吧 走吧 Just go Just go 别随便歌颂 Don’t exalt heedlessly 我拉开了双拳 I raise my fists in a fighting stance 瞄准沸腾的时间 Aiming at the raging time 走吧 走吧 Just go Just go 别大声反驳 Don’t dispute loudly 在等我巡游 Waiting for me to cruise around 变暗的字轴 fading calligraphy scrolls and 终场的困兽 trapped beasts in the final round 当决斗问候 When the duel sends its greetings to – 焦黑的烟斗 charred smoking pipes 乱线的图谋 and tangled lines of ploys 向暴戾迎击 Fight against tyranny head-on 反转后重写默剧 Rewrite the mime after the reversal 让真相 痛快去演奏 Let the truth freely play its tune","link":"/04-13-jackdaw/"},{"title":"Candle (蜡烛) DEMO","text":"Officially released on May 3, 2020.Played only once: October 14, 2017 at Mars Concert 2017. When Hua Chenyu created this song, he sat in a pitch-black room with the only furniture as a piano, lit many candles around him, imagined the candlelight as glow sticks at a live concert, and completed the song all at once.Hua explained, “Even though I played some parts wrong on DEMO, the emotion contained within is perfect for this song.” and after writing this song, he could no longer find the feeling he had when he wrote it.He didn’t want to sing a song to the fans in such an imperfect way, so at the Mars Concert 2017, he played the DEMO directly at the concert, surrounding by glow sticks, and finished listening to this DEMO quietly with his fans. Mars Concert 2017 Compose: Hua Chenyu no lyrics","link":"/04-14-candle/"}],"tags":[{"name":"Compose","slug":"compose","link":"/tags/compose/"},{"name":"MV","slug":"MV","link":"/tags/MV/"},{"name":"Album01-Quasimodo&#39;s Gift","slug":"album01","link":"/tags/album01/"},{"name":"Lyrics Translation","slug":"lyrictranslation","link":"/tags/lyrictranslation/"},{"name":"Singer 2018","slug":"singer2018","link":"/tags/singer2018/"},{"name":"OST","slug":"OST","link":"/tags/OST/"},{"name":"Symphony","slug":"symphony","link":"/tags/symphony/"},{"name":"Unplugged","slug":"Unplugged","link":"/tags/Unplugged/"},{"name":"eSports","slug":"esports","link":"/tags/esports/"},{"name":"NEWS","slug":"NEWS","link":"/tags/NEWS/"},{"name":"MARS CONCERT","slug":"MARS-CONCERT","link":"/tags/MARS-CONCERT/"},{"name":"Arrange","slug":"arrange","link":"/tags/arrange/"},{"name":"Superboy 2013","slug":"2013boy","link":"/tags/2013boy/"},{"name":"Singer 2020","slug":"singer2020","link":"/tags/singer2020/"},{"name":"Album04-The NEW WORLD","slug":"album04","link":"/tags/album04/"},{"name":"DEMO","slug":"DEMO","link":"/tags/DEMO/"}],"categories":[{"name":"② Music Works","slug":"music","link":"/categories/music/"},{"name":"⑥ Commercial","slug":"commercial","link":"/categories/commercial/"},{"name":"③ Live","slug":"live","link":"/categories/live/"},{"name":"₃ Other","slug":"commercial/othercommercial","link":"/categories/commercial/othercommercial/"},{"name":"₁ Mars Concert","slug":"live/marsconcert","link":"/categories/live/marsconcert/"},{"name":"₂ Events","slug":"live/event","link":"/categories/live/event/"},{"name":"① Profile","slug":"hcy","link":"/categories/hcy/"},{"name":"④ TV Show","slug":"tvshow","link":"/categories/tvshow/"},{"name":"₁ Music Shows","slug":"tvshow/musicshow","link":"/categories/tvshow/musicshow/"}],"pages":[{"title":"404 not found","text":"This page is still under construction. Please look forward to it! &gt;&gt; Return to the home page &gt;&gt; Check the update history of this site","link":"/404.html"},{"title":"Welcome to Mars!","text":"AboutThis website is created by voluntary fans of Hua Chenyu, providing information related to Hua Chenyu. We are the unofficial subtitle group “Hua Chenyu English Subs” running this website. We hope this site can assist everyone in staying updated with the latest information about Hua Chenyu. Unofficial subtitle group “Hua Chenyu English Subs” Purpose：Assisting non-Chinese native speakers to enjoy Hua Chenyu’s musicMotivation：Passion for Hua Chenyu’s music and art Update historyOctober 10th, 2023- The new version of the English information site has been preliminarily established.","link":"/about/"},{"title":"News（Updated on Dec. 8 in 2023）","text":"Compile Hua Chenyu’s latest updates. 2023December “The Beijing News - entertainment weekly (新京报-娱乐周刊)”“Hua Chenyu: I am a person who always likes to fight with myself (华晨宇：我是个喜欢和自己对抗的人)” New single “Extraordinary Ordinary Life (普通到不普通的人生)“Premiere at the Guangzhou concert on December 2nd. Officially released at midnight on the same day.This song inherited the refreshing style of his new song released at the “Mars Concert 2023 Shanghai concert”. MARS CONCERT 2023 (Second Half of the Year) Final - GuangzhouBefore the encore of the final concert, a video clip was aired documenting how the idea for an all-night sunrise concert was conceived and developed. It has been officially announced that the sunrise concert will be held next spring on China’s northern coast during the flowering season. November “Game For Peace” the annual 100-person big challengeAt noon on November 17, 2023, the annual 100-person big challenge called “集合100！(Gathering 100!)” officially began live streaming. Hua participated in two roles: the brand character Hua Chenyu and the professional player @花傲天.The event has invited not only PEL’s professional players, but also well-known anchors and gurus from various social media platforms, as well as many entertainment industry stars. Tmall Double 11 galaThe Double 11, initiated by Tmall in 2009, has been around for 14 years. TMall’s Double 11 is not just a shopping festival but also a promotional extravaganza in the e-commerce industry, having evolved into a holiday for the entire sector.Since 2015, Tmall has collaborated with “Hunan TV” to organize a “Double 11” gala. Subsequently, the joint venture with TV stations to host a shopping frenzy gala has become a tradition.Hua Chenyu will present two songs: “Flight Mode (飞行模式)“ and “Light Up the Bonfire at the Galaxy’s End (点燃银河尽头的篝火)“ for everyone. October MARS CONCERT 2023 (Second Half of the Year) - NanjingTen years ago, the promise that “You didn’t make a mistake in choosing me” was made during the “Superboy 2013“ live tour in Nanjing. This time, he returned to Nanjing and fulfilled his promise. “Ace VS Ace (王牌对王牌)” Season 8Hua Chenyu will appear as a regular MC on the popular variety show “Ace VS Ace (王牌对王牌)”‘s Season 8 this year as well.The program will be broadcast every Friday from October 20th. Magazine “Blog World (博客天下)”, Issue 398.10th-anniversary special interview: “Transcending Solitude, Growing Towards the Sun” September New single “Wind of Sea (风之海)“Premiere at the Shanghai concert on September 28th. Officially released at midnight on the same day.Hua Chenyu’s first attempt at a fresh and simple musical style, and it’s said to be the overall style for his future six albums. MARS CONCERT 2023 (Second Half of the Year) - ShanghaiFrom his debut anniversary on September 27th to the 29th, for three consecutive days, after an 8-year hiatus, he held the Mars Concert in Shanghai once again.","link":"/news/"},{"title":"Stage Design Photo Gallery","text":"Aerial Photography / Main Stage (9p) “Planet” stage (5p) Laser Show (7p)","link":"/media/marsconcert2023/2023-1-stage/"},{"title":"Stage Design Photo Gallery","text":"Promotional Posters (6p) Aerial Photography (17p) Stage Design (32p)","link":"/media/marsconcert2023/2023-2-stage/"},{"title":"Beijing (Bird&#39;s Nest) Concert Images","text":"Rehearsal（12p） Looks Collection（59p）","link":"/media/marsconcert2023/birdnest/"},{"title":"Concert Images","text":"Promotional Posters（4p） Rehearsal（10p） Matinee（2p） Evening Show Opening（5p） ハイライト（18p）","link":"/media/marsconcert2023/all/"},{"title":"Mars Concert 2023: Changsha Concert","text":"The Concert Venue (6p) Looks Collection, day1 (18p) Looks Collection, day2 (18p) Looks Collection, day3 (22p)","link":"/media/marsconcert2023/changsha/"},{"title":"Mars Concert 2023: Chengdu Concert","text":"Looks Collection, day1 (14p) Looks Collection, day2 (16p) Looks Collection, day3 (16p)","link":"/media/marsconcert2023/chengdu/"},{"title":"Mars Concert 2023: Nanjing Concert","text":"Rehearsal (8p) Looks Collection (31p)","link":"/media/marsconcert2023/nanjing/"},{"title":"Mars Concert 2023: Hangzhou Concert","text":"Looks Collection, day1 (15p) Looks Collection, day2 (14p) Looks Collection, day3 (16p)","link":"/media/marsconcert2023/hangzhou/"},{"title":"Mars Concert 2023: Wuhan Concert","text":"Afternoon Tea (3p) Looks Collection, day1 (18p) Looks Collection, day2 (17p)","link":"/media/marsconcert2023/wuhan/"},{"title":"Mars Concert 2023: Shanghai Concert","text":"Rehearsal (8p) Looks Collection (78p)","link":"/media/marsconcert2023/shanghai/"},{"title":"Mars Concert 2023: Guangzhou Concert","text":"Rehearsal (9p) Looks Collection (50p)","link":"/media/marsconcert2023/guangzhou/"}]}