{"posts":[{"title":"Why Nobody Fights","text":"1. About the songReleased on August 15 2014. Toward the end of June 2014, when work on the album Quasimodo’s Gift was in its final stages, Hua Chenyu wrote “Why Nobody Fights” which was inspired by a most unlikely source. In an interview, Hua stated that the inspiration for this song came after watching a soccer match during his travels in Europe. He wanted to dedicate the song to his audience to encourage them to be true to themselves. Hua Chenyu takes great pride in the fact that he wrote the only line of lyrics in this song. He has only one other lyricist credit in his four-album repertoire. With each repetition of that line (why nobody fights), the delivery is slightly different. As a result, recording it wasn’t easy and it took several days. Bernard Zheng, now Hua’s long-time producer, recruited the renowned American mixing engineer, music producer, and multi-instrumentalist, Ken Lewis for the downmixing. Zheng initially invited some friends to sing the chorus, which in a concert setting would be sung by the audience. However, after listening to the rough cut, Hua felt that it was too perfect and decided to go in a different direction. To create the mysterious “choir-inspired” feeling that he wanted, many people would need to participate. Hua then recommended inviting his fans to participate. One hundred fans gathered at a large orchestral recording studio to complete the accompaniment and achieve the dramatic choral effect he had hoped for. 2. VideosAudio linkSpotify MV Making Film 2018 Mars Concert Beijing with ENG Subtitles` 3. LyricsCompose &amp; lyrics: Hua ChenyuArrange: Bernard Zheng ​Why, why nobody fight?Why nobody fight?Why nobody fight?","link":"/01-01-wnf/"},{"title":"Glimmer (微光)","text":"1. About the songReleased in 2014. The interlude music for the TV drama “何以笙箫黙” (Silent Separation).This song is included in the first album “Quasimodo’s Gift“. “Glimmer” just like its name, is a soft and gentle song performed with exceptional tenderness by Hua Chenyu. A piano accompaniment is all that’s needed as he sings this simple melody. The music is sometimes quiet, sometimes it swells. “Glimmer” is intricate and intense, but without the rock edge and technical high notes Hua is known for. This delicate arrangement highlights the beauty and power of Hua Chenyu’s voice and demonstrates his careful control. Still, Hua permits the subtle emotion of the song to shine, which allows the listener to feel that glimmer of light. On April 20, 2018, Hua Chenyu performed this iconic piece during the post-festival of the music competition program “[Singer 2018](/Singer 2018/)” He also had collaborations with the Chinese pianist Lang Lang in various performances. On September 25, 2022, during the online concert “火星乐章 (Mars Chapter)“ celebrating his 9th debut anniversary, Hua Chenyu arranged 11 songs in collaboration with a symphony orchestra and choir. 2. Videos“Mars Chapter” SymphonyENG Subtitles “Mars Concert 2019 Haikuo”ENG Subtitles “Singer 2018”ENG Subtitles “2015 Liaoning TV Spring Festival Gala” feat. Lang Lang 3. Lyrics TranslationLyrics: Zhou Jieying Zhou JieyingCompose: Qian Lei Qian LeiArrange: Bernard Zheng Bernard Zheng 微光 Glimmer 我在黑暗中 In the darkness 化作一颗火种 I became a tinder 想为你 For you 点亮整片的星空 I want to light up the entire starry sky 追随着微风 With the gentle breeze 住进了美梦 I stepped into this sweet dream 你笑着 Your smiling figure 躲在我心中 Hidden deep in my heart 不要烟火不要星光 No need for fireworks nor starlight 只要问问内心的想法 Just ask your heart 在我的世界 In this world of mine 可有个角落 Is there a corner 是你不曾懂的远方 As distant land, you’ve never known? 也许我是一道微光 Perhaps I am a faint glimmering light 却想要给你灿烂的光芒 Yet wishing to enshrine you in dazzling rays 宁愿让我受伤 I would rather get hurt 在黑暗的夜晚 In the darkness of night 静静地为你 Quietly For you 去孤独的照亮 Shine in solitude 就让我是一道微光 Just let me be a glimmer 能让你拥有灿烂的锋芒 That lets you shine brilliantly 在寂寞的时分 In times of loneliness 无论飞向何方 No matter where you fly 我也会绽放 I will still shine 给你无限微光 Giving you an endless glimmer","link":"/01-02-shimmer/"},{"title":"Ashes from Fireworks (烟火里的尘埃)","text":"1. About the songReleased on August 26, 2014. After listening to the demo for “Ashes From Fireworks”, Hua Chenyu felt that the delicate melody was quite suitable for his voice and decided to include it in this album. Xi Lou wrote the song in 2012 to comfort himself while going through a difficult time. The song was similar to the deeply personal song, “I Am What I Am“, covered by Hua Chenyu during the Super Boy 2013 competition. “Ashes From Fireworks” was not the typical kind of song that people were used to hearing. When Bernard Zheng received the demo for “Ashes From Fireworks”, he felt it was a fortuitous coincidence as he knew the composer, Xi Lou. Zheng felt that he and Hua Chenyu shared a common understanding of music, so in order to preserve the original feeling of the song, he asked Xi Lou to help with the arrangement. Xi not only helped complete the second arrangement of the song, but ultimately stayed throughout the entire recording process. This process included five mixing modifications and Xi also recorded the harmony. In keeping with the conceptual ideas of the album, the theme of “smoke” was used throughout the arrangement and lyrics. Albert Leung, a judge for the 2014 Spring Festival Gala, was deeply impressed by Hua’s singing in the competition. Leung was invited and immediately agreed to write lyrics for this album. In preparation for writing, he watched many videos and read many articles about Hua. Following the official recording, Leung changed the lyrics for “Ashes From Fireworks” an additional three times to ensure they represented the true feeling of Hua Chenyu’s inner world, and also to ensure they conformed to his high standards. In order to achieve the desired psychedelic effect of time and space, Hua Chenyu recorded the song so many times that he became hoarse. The end result was that the song appeared to be much easier to sing than it actually was. 2. VideosMVENG Subtitles “Mars Chapter” SymphonyENG Subtitles Shanghai Zebra Music Festival 2018ENG Subtitles 3. Lyrics TranslationLyrics: Albert Leung Albert LeungCompose: Xi Lou Xi LouArrange: Xi Lou、Bernard Zheng Xi Lou, Bernard Zheng 烟火里的尘埃 Ashes from Fireworks 看着飞舞的尘埃 掉下来 Watching the dancing ashes falling to the ground 没人发现它存在 No one notices their existence 多自由自在 So free and unbounded 可世界都爱热热闹闹 But the whole world loves company 容不下 我百无聊赖 There’s no place for me to be listless 不应该 一个人 发呆 I shouldn’t be alone lost in thoughts 只有我 守着安静的沙漠 I’m the only one who guards the silent desert 等待着花开 Waiting for flowers to bloom 只有我 看着别人的快乐 I’m the only one who looks at their happiness 竟然会感慨 And sigh unexpectedly 就让我 听着天大的道理 Just let me listen to these great philosophies 不愿意明白 Unwilling to understand 有什么 是应该 不应该 What should be and what shouldn’t be 我的心里住着一个 苍老的小孩 In my heart, there lives an elderly child 如果世界听不明白 对影子表白 If the world cannot understand Confess to your shadow 是不是只有我 还在问 Am I the only one still asking 为什么 明天更精彩 Why will tomorrow be better 烟火里 找不到 童真的残骸 In the fireworks no remains of innocence can be found 只有我 守着安静的沙漠 I’m the only one who guards the silent desert 等待着花开 Waiting for flowers to bloom 只有我 看着别人的快乐 I’m the only one who looks at their happiness 竟然会感慨 And sigh unexpectedly 就让我 听着天大的道理 Just let me listen to these great philosophies 不愿意明白 Unwilling to understand 只有我 就是我 好奇怪 There’s only me who is only me How strange 还在感慨 I am still sighing 风阵阵吹过来 Gusts of wind blowing past 为何不回来 Why does it not come back 风一去不回来 The wind leaves and never returns 悲不悲哀 Isn’t it sad 麻木得那么快 应不应该 We become numb so fast Shouldn’t it be 能不能慢下来 Can it slow down 笑得开怀 哭得坦率 Laugh to your heart’s content Cry like no one else judges 为何表情 要让这世界安排 Why should my expressions Be arranged by the world 我就是我 我只是我 I am just me, I am only me 只是一场烟火散落的尘埃 Just falling ashes from fireworks 风阵阵吹过来 Gusts of wind blowing past 风一去不回来 The wind leaves and never returns 能不能慢下来 Can it slow down","link":"/01-04-fireworks/"},{"title":"Let You Go","text":"1. About the songReleased on August 29 2014. As soon as Hua Chenyu arrived home one day, he sat down at the piano and began to compose. “Let You Go” was the result. Beginning with the first harmony, the melody was already established, and Hua Chenyu was able to record the music as he played and sang. In his own words, it was “a song written in a song’s time.” After listening to the demo, Hua’s producer Bernard Zheng agreed that the chords he used and the emphatic way he sang “let you go” in English suited the electronic rock style. The arrangement of the song has two distinct parts; the first part of the song has the feeling of restraint, which allows the listener to focus on the vocals and the simple piano accompaniment. In the second part of the song, the restraint fades and energy begins to build. The long introduction creates a feeling of suppression until the end of the interlude where, following the rhythm of the drums and the incorporation of other instruments and electronic sounds, the tones are built and layered to create a theatrical conflict. The singer’s words in Chinese and English, “let you go, 别靠近我 (stay away from me),” intensifies that contrast. During audio mixing, Ken Lewis minimized the rock elements of the song, strengthening instead the electronic components, and finally toning down the guitar. 2. VideosMars Concert 2023 FanCam Mars Concert 2017 Official Video Mars Concert 2016 Official Video 3. Lyrics TranslationComposer: Hua ChenyuLyricist: Xia YuanArranger: Bernard Zheng Let You Go Let You Go 还不是尽头 If this is not the end 就让我继续游走 Let me keep on walking 还没到最后 If it’s not the last 就让我继续忍受 Let me keep on enduring 若是狂风带不走 If the gale can’t take away 残留胸口的念头 The thoughts that linger in my chest 抱着它沉入时间的洪流 Embrace them and sink into the torrent of time 还有快乐就 If there is still happiness 埋进遗忘的沙漠 Bury it in the desert of forgetfulness 还有哀愁都 If there’s still sorrow 抛下绝望的山丘 Abandon the hills of despair 还有什么没卷走 If there’s still something not taken away 留下影子就足够 Leaving shadows is enough 在孤独里头 陪着我 To accompany me in solitude Let you go Let you go 别靠近我 Don’t get close to me 我不是 被动感受的躯壳 I’m not a passive body to feel 没什么 能够夺走 我自由 Nothing can take away my freedom Let you go Let you go 别阻挡我 Don’t stop me 我已经 走在永恒的路上 I’m already on the path to eternity 不退缩 I won’t back down Let you go Let you go 别靠近我 Don’t get close to me 我只为 寻找到真实而活 I live only to find the truth 没什么 能够操纵 我选择 Nothing can manipulate my choices Let you go Let you go 别阻挡我 Don’t block me 我只要 燃烧不在乎陨落 I just want to burn, no matter the fall Let you go Let you go 别让自我被拯救 Don’t let the self be saved","link":"/01-03-lyg/"},{"title":"Bomb Squad (拆弹专家)","text":"Released on August 26, 2014. “Bomb Squad” was another composition by Danish indie rock band Dúné and arranged by Dúné and Bernard Zheng. Zhao Zhisheng, a young lyricist, wrote the rebellious and humorous lyrics. The style of the song is indie rock with imaginative, catchy lyrics. Vocals throughout the song are high-pitched and are accompanied by a chorus of children’s voices along with repeated rhythmic drumming and clapping sound effects. These stylings make the song novel, interesting, and easy for Martians to sing along with. VideosMars Concert 2019 FanCamENG Subtitles Mars Concert 2016 Official VideoENG Subtitles Lyrics TranslationComposer: DúnéLyricist: Zhao ZhishenArranger: Dúné, Bernard Zheng 拆弹专家 Bomb Squad Hell！！No！！ Hell！！No！！ 空气就快要爆炸 The air is about to explode Hell！！No！！ Hell！！No！！ 时间就快要爆炸 Time is about to explode Hell！！No！！ Hell！！No！！ 身体就快要爆炸 My body is about to explode Hell！！No！！ Hell！！No！！ 快给我拆弹专家 Hurry up and get me the Bomb Squad GUCCI PRADA GUCCI PRADA 穿着要足够浮夸 You have to dress extravagantly 才能够表现自己的身价 To flaunt your own worth 算了吧 Forget it 看着你声音沙哑的 Watching you with your hoarse voice 娱乐大家 但 Entertaining the crowd 心中的炸弹快要爆炸 But the bomb in your heart is about to explode Hell！！No！！ Hell！！No！！ 空气就快要爆炸 The air is about to explode Hell！！No！！ Hell！！No！！ 时间就快要爆炸 Time is about to explode Hell！！No！！ Hell！！No！！ 身体就快要爆炸 My body is about to explode Hell！！No！！ Hell！！No！！ 快给我拆弹专家 Hurry up and get me the Bomb Squad","link":"/01-05-bomb/"},{"title":"Traveling (环游)","text":"1. About the songReleased on September 19, 2014. “Traveling” is one of several songs chosen by Hua Chenyu which were composed by the Danish band, Dúné. He liked their songs so much that he actually chose four for his first album. The vocals, sound effects, and instrumentation come together to make “Traveling” sound ethereal, transparent, and psychedelic; as though traveling in outer space. The lyrics describe a journey through life where Hua Chenyu encourages listeners to follow that journey with courage and youthful vitality. The song conveys the positive energy of youth, a new generation of rock style in comparison to the previous heavy and rather angry expression of the former generation. The studio version incorporates a multitude of electronic sound effects, and although perhaps not as popular as “Ashes From Fireworks“ or “I Don’t Care“, “Traveling” is an extremely challenging song to sing with a wide range and many different transitions from one register to another. 2. VideosMars Concert 2021 FanCamENG Subtitles Mars Concert 2019 FanCamENG Subtitles Mars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Nagatomo Chie Mei；Liu YuanCompose: DúnéArrange: Dúné，Bernard Zheng 环游 Traveling 我在 拥挤路口 I stand at a crowded intersection 听人群 争吵不休 Listening to the crowd’s endless quarrels 吵着无谓借口 Arguing over pointless excuses 吵着向左向右 Arguing over going left or right 我环游 这颗星球 I travel around this planet 看时间摆弄着沙漏 Watching how time fiddles with hourglasses 我不原地停留 I don’t want to stand still 我大步行走 I stride forward 走出精彩 Striding towards brilliance 双脚飞 Fly on both feet 没有疲惫 Never tire 飞翔着 倔强的花蕾 Soaring a tenacious flower bud 阳光飞 Fly boldly 没有伤悲 Without sorrows 世界明媚 What a bright world 彼岸爱上寻找 The other shore falls in love with searching 而天空爱上了奔跑 Yet the sky falls in love with running 我们怎敢睡着 How dare we fall asleep 我们怎敢牢骚 How dare we complain 生命这 无休旅程 This life is an endless journey 然后的然后是追逐 Chasing is in the future of the future 看看谁会认输 Let’s see who will concede 看谁会停步 Let’s see who will halt their steps 我会 一路奉陪 I will stay all the way 勇敢飞 Fly bravely 拥吻雨水 Embrace and kiss the rain 逆风让翱翔 更珍贵 Soaring upwind makes the flight more cherished 灿烂飞 Fly gloriously 拥吻沉醉 Embrace and kiss this enchantment 坚强花蕾 An unwavering flower bud 飞翔的花朵 Soaring blossoms 天空的焰火 A blaze in the sky 没有太多言说 Few words are uttered 骄傲的沉默 This proud silence 行进若不退缩 If the march never backs off 梦不会陨落 Then dreams will not fall down 飞翔的自我 The self that flies 勇敢飞 Fly bravely 拥吻雨水 Embrace and kiss the rain 逆风让翱翔更珍贵 Soaring upwind makes the flight more cherished 灿烂飞 Fly gloriously 拥吻沉醉 Embrace and kiss the enchantment 坚强花蕾 An unwavering flower bud","link":"/01-06-travel/"},{"title":"We are all Lonely (我们都是孤独的)","text":"1. About the songReleased on September 19, 2014. A somber melody and uncomplicated lyrics bring a kind of dark mood to this song. It portrays a truth that resonates deep in the heart: we are all lonely. At some point in our lives we all feel alone, our dreams lost, invisible, and unappreciated. We feel the singer’s heartbreak as he exposes his pain. His voice weeps as he describes the falling rain and the lonely road home. The interlude transports us there with him as the sound of the wailing guitar and the singer’s dejected tone accompany us. As the song ends, we feel a final sigh in the gentle tones of the piano and guitar. 2. VideosMars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Dai YuedongCompose: The Blue VanArrange: The Blue Van；郑楠 我们都是孤独的 We are all Lonely 他 忘记了 He forgot the way home 回家的路 街上只剩他 一个人 The way home, on the streets, he was the only one left 游荡 Wandering 他 拥抱过 He once held in his arms 生命中 相遇后又错失的人 The person he met and then lost in life 悲伤 How sad 雨 在下 在下 一整夜 The rain is falling, falling, all night long 他 不作声 不作声 He keeps his silence 他的痛 有谁能懂 His silence, his pains, who can understand? 他的梦 无人过问 His dreams, no one cares 他多么想 多么想 安稳 How desperately he longs, longs for a simple life 他 厌倦了 He has grown weary 所以活在自己的世界里面 So he lives in his own world 天真 How naive 他 明白了 He understands 上帝为他关上窗另开一扇门 God has closed a window and opened another door for him 在等 Waiting 雨 在下 在下 一整夜 The rain is falling, falling, all night long 他 不作声 不作声 He keeps his silence 他的痛 有谁能懂 His silence, his pains, who can understand? 他的梦 无人过问 His dreams, no one cares 他多么想 多么想 安稳 How desperately he longs, longs for peace of mind 他多么想 多么想 安稳 How desperately he longs, longs for peace of mind 雨 在下 在下 一整夜 The rain is falling, falling, all night long 他 不作声 不作声 He keeps his silence 心里的痛 有谁能懂 Pains in the heart, who can understand? 谁的梦 无人过问 Whose dreams, no one cares 他多么想 多么想 安稳 How desperately he longs, longs for peace of mind 我们都是 都是孤独的人 We are all, we are all lonely","link":"/01-07-allalone/"},{"title":"Immortal (不朽)","text":"1. About the songReleased on September 17, 2014. “Immortal” is another song originally composed by indie rock band Dúné and chosen by Hua Chenyu. Given that song selection was made from over 20,000 demos, it’s clear that Hua truly loves the music of this band, as he chose several of their songs in this first album. The fast-paced musical style of “Immortal” is metal, rhythmic, and rocky. There are distinct stylistic differences between the more electronic verses and the rock-style chorus. Bernard Zheng’s arrangement emphasized the guitar segments with a very interesting interlude. The vocals are challenging for the singer, as they are high in the treble range with explosive segments. Hua Hua received praise from the sound engineers during the recording process as he was not only able to sing in that high range for many hours at a time, but also returned the next day rested and able to give his best. The young and wild attitude of the song arises from the combination of melody, instrumentation and Hua’s powerful singing. The wonderful lyrics composed by Guo De Ziyi are determined, proud and unyielding; echoed by the wild cries of a princely, passionate young man. 2. VideosMV Mars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Guo DeziyiCompose: DúnéArrange: Dúné，Bernard Zheng 不朽 Immortal 生活是种借口 Life is an excuse 胁迫人放弃一切拥有 Threatening us to give it all up 我活得捉襟见肘 I’m stretched thin 但是我get it get it But I get it get it 我是 不朽 I am Immortal 虽然 你眼里 的我 Although in your eyes 只不过 一头困兽 I am nothing but a trapped beast 我该 不朽 I should be Immortal 霸占 永恒才足够 Only by seizing eternity can I be satisfied 不屑做 卑微小丑 I’m above being a lowly clown 懦弱不是理由 Cowardice is not an excuse 让我 quit quit quit to fight To let me quit quit quit to fight 随着时间腐朽 As time decays 抱歉我get it get it Sorry, but I get it get it 我是 不朽 I am Immortal 占据 理智的 魔咒 A curse that takes over all rationality 如黑洞 吞噬所有 Like a black hole that devours all 我该 不朽 I should be Immortal 拒绝 被现实遗漏 I refuse to be forgotten by reality 不屑做 卑微小丑 I’m above being a lowly clown 我是 不朽 I am Immortal 就该 被铭记 永久 Should be engraved into memory forever 被侍奉 毫无保留 Served without reservations 我该 不朽 I should be Immortal 受众生 膜拜 永久 Forever worshipped by all beings 我拥有 完美自由 I have the perfect freedom 我是 不朽 I am Immortal 就该 被铭记 永久 Should be engraved into memory forever 被侍奉 毫无保留 Served without reservations 我该 不朽 I should be Immortal 受众生 膜拜 永久 Forever worshipped by the world 我拥有 完美自由 I have the perfect freedom 我本就是不朽 I’m Immortal to begin with 何必妥协迁就 Why should I compromise or yield 现在轮到你叩首 Now it’s your turn to kneel down 说你 get it get it Say you get it get it","link":"/01-08-immortal/"},{"title":"Quasimodo&#39;s Gift (卡西莫多的礼物)","text":"1. About the songReleased on September 12, 2014. Hua Chenyu’s inspiration for “Quasimodo’s Gift” came after seeing an abstract painting in a church in Italy during the European tour of the reality television show “Divas Hit the Road (花儿与少年)“. At that time, because of the program’s regulations, mobile phones had to be turned in to the producers; as a result, he had no device on which to record the melody. After returning to China, he explained that he was not able to remember the melody, but two months later while composing songs for his album, he suddenly recalled that painting and immediately recorded the music on the piano. When writing this song, the picture in Hua Chenyu’s mind was of a church at night, with a lonely sufferer kneeling in front of a single candle. “Quasimodo’s Gift” is in some ways classical in style, but is still infused with popular musical elements. Bernard Zheng produced the music so that the painful feelings evoked by the demo became more beautiful and sad. He also included the sounds one would experience on a dark and rainy night, such as thunder, lightening, and church bells. These environmental sounds immediately bring to mind a lonely singer in the dark. It took Hua Chenyu only about two hours to record this song. 2. VideosShort Movie MVENG Subtitles “Mars Chapter” SymphonyENG Subtitles 3. Lyrics TranslationLyricist: Bei ZiCompose: Hua ChenyuArrange: Bernard Zheng 卡西莫多的礼物 Quasimodo’s Gift 夜晚传来钟声 The sound of bells rang through the night 风熄灭了蜡烛 The wind blew out the candle 钟楼外 他的歌声 Outside the bell tower / His singing 回荡夜空 Echoes through the night 镜子里的怪物 The monster in the mirror 穿着同样衣服 Is dressed the same 在无助眼神之中 In helpless eyes 是无边的孤独 呜 Lies unending loneliness 沉痛的歌 This melancholic song 在诉说 Is crying out that 这不是谁的错 This is nobody’s fault 卡西莫多的礼物 Quasimodo’s Gift 享受孤独 Enjoying loneliness 阳光从不光顾 Sunshine never visits me 月光为我伴舞 Moonlight dances for me 巴黎夜晚的钟声 Ringing bells in the night of Paris 是我的音符 Are my musical notes 如果习惯痛苦 If I’m used to the pain 眼泪不会很苦 The tears won’t taste too bitter 若你伤悲 If you are sad 让我钟声 Let my ringing bells 给你安慰 Comfort you 沙哑的歌 含着泪 This rasping song 含着泪 Brimming with tears 也为你祝福 Still gives you its blessings 卡西莫多的礼物 Quasimodo’s Gift 享受孤独 Enjoying loneliness","link":"/01-09-quasimodo/"},{"title":"Bedside Story (枕边故事)","text":"1. About the songReleased on September 19, 2014. “Bedtime Story” is not what you would call a “big” song, with only a guitar for accompaniment; however, the lyrics are simple and touching. They relate the fairy tale story of a princess who falls in love with a frog, marries him against the family objections, and then they go away to live happily ever after. The novice songwriter, Ronald Tsui, spent a few years in the UK and was influenced by 90s pop, R&amp;B, and soul, but was focused on two things; simplicity and love. The writer of the lyrics in Chinese, Dai Yuedong, emailed them in the middle of the night to Hua, laughingly pointing out the frogs, the prince, and the fairy tale-like aspects of the subject matter. It was love at first sight for Hua Hua. 2. VideosMars Concert 2016 Official VideoENG Subtitles 3. Lyrics TranslationLyricist: Dai YuedongCompose: Ronald TsuiArrange: Niu Zijian 枕边故事 Bedtime Story 就让我轻轻为你 Let me gently 讲一个枕边故事 Tell you a bedtime story 从前有个长发公主 Once upon a time there was a long-haired Princess 悄悄爱上一只青蛙 Who secretly fell in love with a Frog 青蛙每天都为她唱歌 Everyday the Frog would sing for her 国王皇后都反对他 Neither the King nor Queen approved of him 但是公主说他是我心上人 But the Princess said / He is my beloved 我不能就这样和他道别 I cannot bid him farewell just so 谁知道 Who knew 小青蛙变成王子 The Frog turned into a Prince 带着他的公主逃离皇宫 The Prince took his Princess away from the palace 私奔到一个 Eloping to a land 没人打扰的地方 Where they can live in peace 从此后两个人 And the two of them 幸福的在一起 Lived happily ever after 这是他和她的童话 This is his and their fairy tale 谁知道 Who knew 小青蛙变成王子 The Frog turned into a Prince 带着他的公主逃离皇宫 The Prince took his Princess away from the palace 私奔到一个 Eloping to a land 没人打扰的地方 Where they can live in peace 从此后两个人 And all of them 幸福的在一起 Lived happily ever after 这是他和她的童话 This is his and their fairy tale 明天我还会为你 Tomorrow too I will tell you 讲一个枕边故事 Another bedtime story 今晚月亮也想睡了 Tonight even the moon is sleepy 在你耳边说声晚安 Whispering in your ear Good night","link":"/01-10-pillow/"},{"title":"Discography","text":"An index of all Hua Chenyu’s music works, including work details and purchase options. 1. Albumsin reverse order of release 5th “Hope Forget” Versions: Electronic edition / Chinese USB edition / Global CD editionFull original albumRelease dates: December 20, 2022 / May 10, 2023Online music sources: SpotifyCD online purchase: yesasia | taiwan FIVE music 希忘Hope Hope Forget Lyricist Composer 1 飞行模式MV Flight Mode Lyu Yiqiu Hua Chenyu 2 小镇里的花MV Flowers in a Small Town Lyu Yiqiu Hua Chenyu 3 小镇里的花Traditional Chinese Instruments Ver. Flowers in a Small Town Lyu Yiqiu Hua Chenyu 4 黑白艺术家 Black and White Artist Lyu Yiqiu Hua Chenyu Healing TrilogyStruggle Chapter 好想我回来啊 Searching for Myself Pei Yu Hua Chenyu Healing TrilogyHope Chapter 花落时相遇 We Meet When Flowers Fade Pei Yu Hua Chenyu Healing TrilogyFuture Chapter 走，一起去看日出吧 Let’s Go and Watch the Sunrise Pei Yu Hua Chenyu 8 向阳而生MV Growing Toward the Sun Lyu Yiqiu Hua Chenyu 9 点燃银河尽头的篝火 Light Up the Bonfire at the Galaxy’s End Lyu Yiqiu Hua Chenyu 10 当全世界忘了我 When the World Forgets Me nekoy Hua Chenyu 11 虚幻与现实 Illusion and Reality Lyu Yiqiu Hua Chenyu 2021火星演唱会全纪录Documentary 2021 Mars Concert Complete Record 4th “NEW WORLD” Versions: Versions: Electronic edition / Chinese USB edition / Global Version (2CD, Out of print)Full Original AlbumRelease Dates: May 3, 2020 / June 15, 2020 / June 15, 2020China Exclusive ‘Mars Necklace’ Limited Edition (USB, with Three Special Bonuses): Purchase on TaobaoOnline: Spotify | Amazon Music | KKBOXIFPI Certification: USB Edition = 6x Platinum Record, CD Edition = 2x Platinum Record + 1x Gold Record 新世界NEW WORLD NEW WORLD Lyricist Composer A1 斗牛MV Bullfight Pei Yu Hua Chenyu Mars Triology 好想爱这个世界啊 I’m Here AKAI Really Want toLove This World Pei Yu Hua Chenyu Mars Triology 疯人院 Madhouse Lyu Yiqiu Hua Chenyu Mars Triology 与火星的孩子对话MV Conversations with Martian Children Hua ChenyuET Hua Chenyu A5 七重人格 Seven Personalities Lyu Yiqiu Hua Chenyu A6 神树 God Tree Pei Yu Hua Chenyu A7 降临 Arrival Ding Yanxue Hua Chenyu A8 新世界 New World Ding Yanxue Hua Chenyu B1 寻MV Seek Shi He Hua Chenyu B2 无聊人 I’m Boring Pei Yu Hua Chenyu B3 齐天MV Qi Tian Ding YanxueJin HezaiFang Hao Hua Chenyu B4 智商二五零 IQ250 Pei Yu Hua Chenyu B5 寒鸦少年MV Jackdaw Boy Ding Yanxue Hua Chenyu B6 蜡烛DEMO Candle Hua Chenyu 2018华晨宇火星演唱会Documentary 2018 Hua ChenyuMars Concert 3rd “H” Version: China Version (USB)Release Date: March 4, 2017Out of print H H Lyricist Composer 1 Here We Are Here We Are Mo AnqiZhaoYīteng Hua Chenyu 2 巨鹿 Giant Deer Dai Yuedong Hua Chenyu 3 To Be Free To Be Free Yue Yin Hua Chenyu 4 For Forever For Forever MIKHAÉL Hua Chenyu 5 我离孤单几公里 Miles Away From Loneliness Yi Jiayang Hua Chenyu 6 消失的昨天 Vanished Yesterday Yao Ruolong Wang Zi 7 造物者 The Creator Shi He Peter BostromAndreas Ohrn 8 我的滑板鞋2016 My Skateboard Shoes 2016 Joseeh PunmanlonHua Chenyu Hua ChenyuJoseeh Punmanlon 9 巨鹿 Voiceless Giant Deer Voiceless - Hua Chenyu 2nd “Aliens” Versions: China Version (USB) / China Version (CD) / Global Version (CD)Release Date: December 15, 2015Out of printOnline music sources: Spotify Contrary to the first album, which emphasized personal insignificance from a low perspective, in the second album, Hua Hua focused on self-worth and opted for a higher, more macro perspective. 异类 Aliens Lyricist Composer 1 我管你MV I Don’t Care Guo Deziyi Hua Chenyu 2 国王与乞丐MV King and Beggar Dai Yuedong Mike ChanFaizal Tahir 3 蜉蝣MV Mayfly Dai Yuedong Hua Chenyu 4 反义词 Antonym Xiao Han Wang Zi 5 异类MV Aliens Zhao Chenlong (NZBZ) Hua Chenyu 6 逃离乌托邦 Escape from Utopia Dai Yuedong Aurora AksnesMartin Odd SkalnesMagnus Skylstad 7 世界是个动物园 The World is a Zoo Dai Yuedong Hua Chenyu 8 变相怪杰 The Mask Dai Yuedong TakuyaLin ChengyouJimmy FungHua Chenyu 9 写给未来的孩子 To my Future Child Zhu Ziqing Hua Chenyu 10 地球之盐 Salt of the Earth Xiao JunfengDai Yuedong Hua Chenyu 11 忧伤的巨人 Giant in Sorrow Dai Yuedong Hua Chenyu 1st “Quasimodo’s Gift” Versions: China Version (CD) / Global Version (CD)Release Date: September 19, 2014Out of printOnline music sources: Spotify When preparing this album, Hua Chenyu’s original thought was to call it Size 40, since this is his own shoe size. The idea behind Size 40 was that a person really doesn’t need to take up too much space in the world. After all, you only have two feet, so you only need so much space to stand in. In true Hua Hua fashion, his sentiment is to just “go with the flow”; otherwise, there’s no need to make a big fuss. As long as you’re standing, your existence is valuable. Later, after receiving the lyrics for the song “Quasimodo’s Gift”, he changed his mind. He really liked the lyrics to the song, as they were true to the melody. This was the feeling he wanted for the album, so he decided to use the name of the song as the name of the album. He hoped everyone would learn to accept the negative things in life, even the ugliness we may encounter. Since everything has two sides, beauty may be hidden within those negative things. It’s just a matter of learning to see both the good and the bad.Among the ten songs on the album, three were Hua’s original compositions; “Why Nobody Fights”, “Let You Go”, and “Quasimodo’s Gift”. In addition to composing for this album, Hua also participated in the entire production of the album as well as selected the other seven songs from nearly 20,000 demos. All the songs chosen for this album are connected by the themes of thunder, rain, smoke, dew, light and dreams. The album was produced by Bernard Zheng and production lasted for nine months. Zheng arranged nine of the songs in rock and roll style and he also did the piano and guitar arrangements for the album. The copywriting for Hua Chenyu’s first album was prepared by Wu Mengzhi, now a director for Hunan TV. 卡西莫多的礼物 Quasimodo’s Gift Lyricist Composer 1 Why Nobody FightsMV Why Nobody Fights Hua Chenyu Hua Chenyu 2 微光 Glimmer Zhou Jieying Qian Lei 3 Let You Go Let You Go Xia Yuan Hua Chenyu 4 烟火里的尘埃MV Ashes from Fireworks Albert Leung Xi Lou 5 拆弹专家 Bomb Squad Zhao Zhisheng Dúné 6 环游 Traveling Nagatomo Chie MeiLiu Yuan Dúné 7 我们都是孤独的 We are all Lonely Dai Yuedong The Blue Van 8 不朽MV Immortal Guo Deziyi Dúné 9 卡西莫多的礼物Short Movie Quasimodo’s Gift Bei Zi Hua Chenyu 10 枕边故事 Bedside Story Dai Yuedong Ronald Tsui 2. Non-Album Singlesin reverse order of release English Title Chinese Title Release Date Sea of Wind 风之海 2023.9.28 War God in Dire Straits 绝境战神 2023.8.17 No Fear of Heat 肆无惧燥 2022.6.15 Iconic moment 名场面 2022.3.14 Flying Conductor 飞行指挥家 2021.4.26 Quench Every Thirst 无渴不爽 2021.3.22 Endless Thirst 渴不停 2020.4.2 You Have To BelieveThis Is Not the Last Day 你要相信这不是最后一天 2020.2.21 Folding 声希 2019.1.13 Fresh Trip 夏之旅 2018.6.6 Hi Summer 嗨夏 2017.6.15 Follow Me 随我 2017.4.11 Wounded in Fights 挂彩 2017.1.9 Through My Heart 穿心 2016.11.7 Mars Intelligence Agency 火星情报局 2016.4.7 Rampage 横冲直撞 2016.3.7 Cancer 癌 The Return of the Master 高手归来 This is Young 就这Young Spring 春 2014.11.27 Hi! Freedom Hi！自由 Goodbye, Youth 青春再見 I and Me 我和我 Lyricless Song 无字歌 2013.6.29 3. Re-arranged Cover Songsin reverse order of release English Title Chinese Title Release Date Jump! The World 离开地球表面 2023.6.3 Ceased 静止 2023.5.20 Reset 归零 2023.5.20 Holding Hands 牵手 2023.5.13 Enjoy 安九 2023.5.6 Us, Later On 后来的我们 2023.4.30 Lucky as You 美好的事可不可以发生在我身上 2023.4.20 Bright Days 闪亮的日子 2023.4.13 The Green Ali Mountain 高山青 2023.4.6 Contentment 知足 2023.3.30 Dancing Siren 舞娘 2023.3.23 Must Be Happy 一定要幸福 2023.3.16 West Gate Youth 西门少年 2020.4.24 Contra in the Wild 荒野魂斗罗 2020.2.28 Ace VS Ace 王牌对王牌 2019.5.8 Tattered Shoes,Frayed Hat 鞋儿破 帽儿破 2019.3.1 Shouts 呐喊 2018.4.13 Light Years Away 光年之外 2018.4.13 The Ordinary Path 平凡之路 2018.3.30 Fake Monk 假行僧 2018.3.23 Wayfarer 山海 2018.3.16 Flammable and Explosive 易燃易爆炸 2018.3.9 Nunchucks 双截棍 2018.2.16 Child 孩子 2018.2.9 Insignificance 渺小 2018.1.13 Idiot 白痴 2018.1.6 Drunk As Lonely Hero 一人饮酒醉 2017.12.16 Dad, I’m Home 爸，我回来了 2017.12.9 Code Name Contra 代号魂斗罗 2017.11.25 Maiden Of Alisan 阿里山的姑娘 2017.10.15 You Better Not Think About Me 你就不要想起我 2017.9.2 Mr. Soso 差不多先生 2017.9.2 Perhaps Love 如果爱 2017.1.1 If You were Li Bei 如果你是李白 2016.12.25 Nanping Evening Bell 南屏晚钟 2016.12.18 Flammable and Explosive 易燃易爆炸 2016.12.11 Great Sage Equal To Heaven 齐天大圣 2016.11.27 Mice Loves Rice 老鼠爱大米 2016.11.6 My Skateboard Shoes 2016 我的滑板鞋2016 2016.10.30 The Kill The Kill 2013.7.12 4. Cover Songsin reverse order of release English Title Chinese Title Release Date Once You Were a Youth 你曾是少年 2022.7.1 Why are the flowers so red? 花儿为什么这样红 2022.6.10 Us 我们 2020.3.6 I am What I am 我 2018.4.6 Do It While You Are Still Young 趁你还年轻 Somebody That I Used to Know 2013.8.2 Chasing Dreams With a Childlike Heart 追梦赤子心 5. Composing for Othersin reverse order of release Artist English Title Chinese Title Release Date Karen Mok Half a Lifelong Romance 半生缘 2018.5.31","link":"/allmusicdata/"}],"tags":[{"name":"Compose","slug":"compose","link":"/tags/compose/"},{"name":"MV","slug":"MV","link":"/tags/MV/"},{"name":"Singer 2018","slug":"Singer-2018","link":"/tags/Singer-2018/"},{"name":"Lyrics Translation","slug":"lyrictranslation","link":"/tags/lyrictranslation/"},{"name":"OST","slug":"OST","link":"/tags/OST/"},{"name":"Symphony","slug":"symphony","link":"/tags/symphony/"},{"name":"Unplugged","slug":"Unplugged","link":"/tags/Unplugged/"},{"name":"Album01-Quasimodo&#39;s Gift","slug":"album01","link":"/tags/album01/"}],"categories":[{"name":"② Music Works","slug":"music","link":"/categories/music/"}],"pages":[{"title":"404 not found","text":"This page is still under construction. Please look forward to it! &gt;&gt; Return to the home page &gt;&gt; Check the update history of this site","link":"/404.html"},{"title":"Welcome to Mars!","text":"AboutThis website is created by voluntary fans of Hua Chenyu, providing information related to Hua Chenyu. We are the unofficial subtitle group “Hua Chenyu English Subs” running this website. We hope this site can assist everyone in staying updated with the latest information about Hua Chenyu. Unofficial subtitle group “Hua Chenyu English Subs” Purpose：Assisting non-Chinese native speakers to enjoy Hua Chenyu’s musicMotivation：Passion for Hua Chenyu’s music and art Update historyOctober 10th, 2023- The new version of the English information site has been preliminarily established.","link":"/about/"},{"title":"News（Updated on Nov. 6 in 2023.）","text":"Compile Hua Chenyu’s latest updates. 2023October Magazine「博客天下」Blog World, Issue 398.10th-anniversary special interview: “Transcending Solitude, Growing Towards the Sun” 9月 New single “Wind of Sea”(/kazenoumi/)」Premiere at the Shanghai concert on September 28th. Officially released at midnight on the same day.Hua Chenyu’s first attempt at a fresh and simple musical style, and it’s said to be the overall style for his future six albums. MARS CONCERT 2023 (Second Half of the Year) - Shanghai From his debut anniversary on September 27th to the 29th, for three consecutive days, after an 8-year hiatus, he held the Mars Concert in Shanghai once again.","link":"/news/"},{"title":"Stage Design","text":"Aerial Photography / Main Stage（9p） “Planet” stage（5p） Laser Show（7p）","link":"/media/marsconcert2023/2023-1-stage/"},{"title":"Posters &#x2F; Stage Design","text":"Promotional Posters（6p） Aerial Photography（14p） Stage Design（25p）","link":"/media/marsconcert2023/2023-2-stage/"},{"title":"Concert Images","text":"Promotional Posters（4p） Rehearsal（10p） Matinee（2p） Evening Show Opening（5p） ハイライト（18p）","link":"/media/marsconcert2023/all/"},{"title":"Mars Concert 2023: Chengdu公演","text":"Looks Collection, day1（14p） Looks Collection, day2（16p） Looks Collection, day3（16p）","link":"/media/marsconcert2023/chengdu/"},{"title":"Mars Concert 2023: Hangzhou公演","text":"Looks Collection, day1（15p） Looks Collection, day2（14p） Looks Collection, day3（16p）","link":"/media/marsconcert2023/hangzhou/"},{"title":"Beijing (Bird&#39;s Nest) Concert Images","text":"Rehearsal（12p） Looks Collection（59p）","link":"/media/marsconcert2023/birdnest/"},{"title":"Nanjing Concert Images","text":"Rehearsal（8p） Looks Collection（31p）","link":"/media/marsconcert2023/nanjing/"},{"title":"Mars Concert 2023: Wuhan公演","text":"Afternoon Tea（3p） Looks Collection, day1（18p） Looks Collection, day2（17p）","link":"/media/marsconcert2023/wuhan/"},{"title":"Mars Concert 2023: Changsha公演","text":"The Concert Venue（6p） Looks Collection, day1（18p） Looks Collection, day2（18p） Looks Collection, day3（22p）","link":"/media/marsconcert2023/changsha/"},{"title":"Shanghai Concert Images","text":"Rehearsal（8p） Looks Collection（78p）","link":"/media/marsconcert2023/shanghai/"}]}